fancy_pcr.org
http://work.lenovo.com/issue/browse/PCR

#+TITLE: MBG PCR LIST
#+AUTHOR: Zhang Jing
#+OPTIONS: ^:nil


|  id | class       | summary                                                            | platform   | status  | accept? | submit? | review                                                   |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|   1 | dram size   | ZRAM/KSM                                                           | 8794       | valid   | TBD     |         | small dram size project                                  |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|   2 | boot time   | multi-thread to scan package; increase GC threshold                | mtk & 8794 | valid   | Yes     | no      | verify on k9 ?                                           |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|   3 | perf        | app switch time with 空灵触控：fixed by app                        |            | invalid | N       |         | app bug & fixed, ignore                                  |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|   4 | touch       | list view scroll too short distance: SCROLL_FRICTION/TOUCH_SLOP    | common     | valid   | TBD     |         | customize according to sceen size and 阻尼系数           |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|   5 | benchmark   | Antutu: cheating by gpu/cpu performance mode when detect antutu    | mtk & 8794 | valid   | TBD     | no      | qcom add new Performance interface in framework          |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|   6 | audio       | BT A2DP when suspend (adjust cpu schedule policy)                  | common     | valid   | No      | no      | side effect on power, patch only if with same bug        |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|   7 | call        | incoming call                                                      | common     | valid   | N       |         | L call app may not suffer the problem                    |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|   8 | suspend     | resume from suspend and light screen                               | qcom       | valid   | Yes     | partial | reduce delay in setup hw registers, and some dsi config? |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|   9 | dram        | LMK parameter adjust                                               | common     | invalid | Yes     | yes     | 12/256/512 used for k9                                   |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  10 | boot        | broadcast slow at boot up time                                     | common     | invalid | N       |         | google fix this problem,                                 |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  11 | boot        | broadcast slow at boot up time (dup)                               | common     | dup     | N       |         |                                                          |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  12 | ui          | volumn button hard to use                                          |            | invalid | N       |         | not perf issue, ignore                                   |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  13 | boot time   | factory mode boot up time : remove selinux(restorecon_xxx("/sys"") | mtk only   | valid   | N       |         | qcom do not need this                                    |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  14 | app crash   | app freeze: expand default binder buffer size by 128KB             | common     | valid   | No      | no      | not merge if no failure                                  |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  15 | dram        | adjust vmalloc threshold to avoid vmalloc fail                     | common     | valid   | No      | no      | not merge if no vmalloc fail                             |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  16 | boot time   | raise the preload GC threshold to avoid frequent GC (dup)          | common     | dup     | N       |         |                                                          |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  17 | boot time   | boost first time bootup with LOCAL_DEX_PREOPT (odex, user load)    | common     | valid   | TBD     |         | ART                                                      |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  18 | media       | galary database update too slow after sd swap                      | common     | valid   | Yes     | partial | jcommand to rm media dbs, retest with k9?                |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  19 | database    | EMMC NOSYNC mode: SQLITE_NO_SYNC (sqlite3.c)                       | common     | invalid | N       |         | for poor emmc                                            |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  20 | database    | ATOMIC_WRITE mode (k900)                                           | common     | valid   | Yes     | no      | merge after verify with k9                               |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  21 | launcher    | adjust LMK adj for laucher to avoid kill when low memory           | common     | invalid | N       |         | useful for small memory devices                          |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  22 | touch       | adjust long press time from 500ms to 350-400ms (ref 240ms)         | common     | valid   | TBD     |         | behavior, not perf issue                                 |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  23 | settings    | reduce settings  memory usage                                      | common     | invalid | N       |         | for small memory devices                                 |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  24 | 3rd app     | improve key 3rd party app perf with HW_accel                       | common     | valid   | N       |         | check top 3rd party app default enable hw_accl           |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  25 | app lauch   | temperary adjust cpu sched policy to boost app launch              | common     | valid   | Yes     | no      | merge after verify on k9                                 |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  26 | low power   | adjust cpu sched policy (set cpu freq limit according to app list) | common     | valid   | No      | no      | impact user experience, not recommend on high-end device |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  27 | touch       | false alarm in edge, touch driver filter                           | common     | valid   | TBD     |         | not perf issue                                           |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  28 | app         | calling app perf                                                   | common     | invalid | N       |         | implement in app, not perf issue                         |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  29 | app lauch   | [PCR-25]boost first time app lauch(no screenshot for home screen)  | common     | valid   | Yes     | no      | include in PCR-25                                        |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  30 | animation   | switch animation                                                   | common     | invalid | N       |         | not perf issue                                           |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  31 | gesture     | improve gesture performance in screen off mode                     | common     | invalid | N       |         | no code                                                  |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  32 | camera      | boost camera start up flow in screen off mode                      | common     | invalid | N       |         | no code                                                  |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  33 | toolchain   | gcc-4.8-linaro, -O2, neon-vfp4 (stability issue)                   | common     | invalid | N       |         | no code                                                  |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  34 | orientation | qcom improve orientation change perf                               | qcom       | invalid | N       |         | qcom driver include the patch                            |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  35 | display     | opengl tuning                                                      | common     | valid   | Y       | no      | need customization                                       |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  36 | touch       | touch FW (landlock distance tuning)                                | common     | invalid | N       |         | FW, not SW                                               |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  37 | dram        | config zram size to balance perf/function                          | common     | invalid | N       |         | small memory devices only                                |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  38 | dram        | DRAM turbo mode (risky)                                            | common     | invalid | N       |         | stability issue                                          |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  39 | input       | improve input event response by change cpu freq                    | common     | valid   | Yes     |         | qcom new Performance api support this ?                  |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|  40 | perf        | neon in skia/bionic memcpy                                         | mtk        | valid   | Yes     |         | no code                                                  |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
| 117 | low power   | same as PCR-26                                                     | common     | dup     | N       |         |                                                          |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
| 118 | display     | non-linear backlight                                               | common     | valid   | TBD     |         | not perf issue                                           |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
| 119 | low power   | same as PCR-26                                                     |            | dup     | N       |         |                                                          |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
| 120 | camera      | boost camera lauch                                                 | qcom, mtk  | valid   | Yes     | yes     |                                                          |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
| 123 | low power   | limit cpu freq according to thermal                                | qcom       | valid   | Yes     | no      | need verify on k9                                        |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
| 124 | dalvik      | GC threshold                                                       | mtk        | dup     | N       |         | no code                                                  |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
| 125 | wifi        | wifi RTS threshold 2347->2346                                      | common     | new     | N       |         |                                                          |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
| 127 | wifi        | wifi ST enhance                                                    | common     | new     | N       |         |                                                          |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
| 133 | home        | return to home screen slow (reduce snapshot operation 2->1)        | common     | valid   | Yes     | no      | no code                                                  |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
| 141 | perf        | From PCR-10, a VIP broadcast channel                               |            | dup     | N       |         |                                                          |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
| 142 | display     | resume and display light up 600ms                                  |            | dup     | N       |         |                                                          |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
| 143 | display     | PCR-8: resume and display light up (optimize to 300ms)             |            | dup     | N       |         |                                                          |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
| 144 | perf        | PCR-14/15                                                          | common     | dup     | N       |         |                                                          |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
| 146 | wifi        | wifi signal strength                                               |            | new     | N       |         |                                                          |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
| 147 | perf        | PCR-141                                                            |            | new     | N       |         |                                                          |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
| 154 | BT a2dp     | PCR-6                                                              |            | dup     | N       |         |                                                          |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
| 156 | display     | PCR-35                                                             |            | dup     | N       |         |                                                          |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
| 160 | touch       | touch feedback                                                     |            | new     | N       |         | not perf issue                                           |
|-----+-------------+--------------------------------------------------------------------+------------+---------+---------+---------+----------------------------------------------------------|
|     |             |                                                                    |            |         |         |         |                                                          |


