data/60/950ec2-44bb-4f19-b53b-bd7dcd17ef3f/fancy_pcr.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>MBG PCR LIST</title>
<!-- 2015-05-05 周二 17:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Zhang Jing" />
</head>
<body>
<div id="content">
<h1 class="title">MBG PCR LIST</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. zram/ksm</a>
<ul>
<li><a href="#sec-1-1">1.1. memory low after long time usage</a></li>
<li><a href="#sec-1-2">1.2. for android version above 4.2 and small dram devices</a></li>
<li><a href="#sec-1-3">1.3. ksm -&gt; 开机时配置扫描页数和频率，zram -&gt; 开机建立和挂载swap分区供压缩</a></li>
<li><a href="#sec-1-4">1.4. kernel/msm</a></li>
<li><a href="#sec-1-5">1.5. vendor/qcom/copper</a></li>
</ul>
</li>
<li><a href="#sec-2">2. boot: boot time</a>
<ul>
<li><a href="#sec-2-1">2.1. long boot time in normal boot</a></li>
<li><a href="#sec-2-2">2.2. multi-thread to scan package; increase GC threshold</a></li>
<li><a href="#sec-2-3">2.3. frameworks/base</a></li>
<li><a href="#sec-2-4">2.4. frameworks/native</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1. <span class="todo TODO">TODO</span> change too much and different on L, not reviewed</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. touch: list view scroll too slow</a>
<ul>
<li><a href="#sec-3-1">3.1. 手指滑动相同距离，列表滚动距离短</a></li>
<li><a href="#sec-3-2">3.2. frameworks/base</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. <span class="todo TODO">TODO</span> need customize according to screen characteristics</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. app swith</a>
<ul>
<li><a href="#sec-4-1">4.1. ignore (app fix)</a></li>
</ul>
</li>
<li><a href="#sec-5">5. benchmark: antutu</a>
<ul>
<li><a href="#sec-5-1">5.1. cheat by cpu/gpu performance mode when detect benchmark app (improve benchmark by 1000-2500)</a></li>
<li><a href="#sec-5-2">5.2. hacking method</a></li>
<li><a href="#sec-5-3">5.3. frameworks/base</a></li>
<li><a href="#sec-5-4">5.4. <span class="todo TODO">TODO</span> qcom has add a common Performance api(perflock) in framework laywer in L</a></li>
</ul>
</li>
<li><a href="#sec-6">6. BT A2DP when suspend</a>
<ul>
<li><a href="#sec-6-1">6.1. 灭屏状态音乐卡顿</a></li>
<li><a href="#sec-6-2">6.2. 蓝牙耳机播放音乐，cpu在灭屏状态使用2 core, 音乐停止，让cpu恢复灭屏single core default setting.</a></li>
<li><a href="#sec-6-3">6.3. external/bluetooth/bluedroid</a></li>
<li><a href="#sec-6-4">6.4. system/core</a></li>
<li><a href="#sec-6-5">6.5. vendor/qcom-proprietary</a></li>
<li><a href="#sec-6-6">6.6. device/qcom/common</a></li>
</ul>
</li>
<li><a href="#sec-7">7. call app: incoming call response</a>
<ul>
<li><a href="#sec-7-1">7.1. 待机来电亮屏时间，提高响铃和页面显示的同步性</a></li>
<li><a href="#sec-7-2">7.2. 通话界面显示的逻辑优化，UI加载的时间优化，平衡来电铃音，亮屏速度与锁屏界面处理时机等，理论上缩短时间300-500ms.</a></li>
<li><a href="#sec-7-3">7.3. packages/apps/LenovoTeleservice</a></li>
</ul>
</li>
<li><a href="#sec-8">8. resume from suspend (screen light up)</a>
<ul>
<li><a href="#sec-8-1">8.1. 优化亮屏速度 （使用双MIPI DSI方案的平台）</a></li>
<li><a href="#sec-8-2">8.2. kernel/msm</a>
<ul>
<li><a href="#sec-8-2-1">8.2.1. <span class="todo TODO">TODO</span> arch/arm/boot/dts/msm8974-mdss.dtsi</a></li>
<li><a href="#sec-8-2-2">8.2.2. <span class="done DONE">DONE</span> drivers/video/msm/mdss/mdss_dsi.c</a></li>
<li><a href="#sec-8-2-3">8.2.3. <span class="done DONE">DONE</span> drivers/vidio/msm/mdss/mdss_dsi_panel.c</a></li>
<li><a href="#sec-8-2-4">8.2.4. <span class="todo TODO">TODO</span> drivers/video/msm/mdss/mdss_r63319.h</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-9">9. LMK</a>
<ul>
<li><a href="#sec-9-1">9.1. small free dram size (<b>procrank</b>)</a></li>
<li><a href="#sec-9-2">9.2. frameworks/native</a>
<ul>
<li><a href="#sec-9-2-1">9.2.1. <span class="done DONE">DONE</span> build/phone-xhdpi-1024-dalvik-heap.mk</a></li>
<li><a href="#sec-9-2-2">9.2.2. <span class="todo TODO">TODO</span> why include xhdpi-1024 not xhdpi-2048 for 3GB project(k9)?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-10">10. broadcast slow</a>
<ul>
<li><a href="#sec-10-1">10.1. frameworks/base</a></li>
</ul>
</li>
<li><a href="#sec-11">11. broadcast slow</a></li>
<li><a href="#sec-12">12. volumn button hard to use</a></li>
<li><a href="#sec-13">13. boot up time in facotry mode (MTK only)</a></li>
<li><a href="#sec-14">14. app freeze and image tranfer fail in wechat</a>
<ul>
<li><a href="#sec-14-1">14.1. expand binder buffer size by 128KB</a></li>
<li><a href="#sec-14-2">14.2. frameworks/native</a></li>
</ul>
</li>
<li><a href="#sec-15">15. vmalloc fail</a>
<ul>
<li><a href="#sec-15-1">15.1. kernel/msm</a></li>
</ul>
</li>
<li><a href="#sec-16">16. boot up time GC</a>
<ul>
<li><a href="#sec-16-1">16.1. raise the preload GC threshold to avoid frequent GC</a></li>
<li><a href="#sec-16-2">16.2. frameworks/base</a></li>
</ul>
</li>
<li><a href="#sec-17">17. boost first time bootup with LOCAL_DEX_PREOPT</a>
<ul>
<li><a href="#sec-17-1">17.1. build</a></li>
</ul>
</li>
<li><a href="#sec-18">18. galary database update too slow after sd swap</a>
<ul>
<li><a href="#sec-18-1">18.1. 双sdcard, SD swap后，强制删除数据库，保证下次开机后快速更新media database, 保证galary, music快速访问数据库</a></li>
<li><a href="#sec-18-2">18.2. <span class="done DONE">DONE</span> device/lenovo/s7</a></li>
<li><a href="#sec-18-3">18.3. <span class="todo TODO">TODO</span> device/lenovo/8939_kk(testmode/jcommand.h)</a></li>
</ul>
</li>
<li><a href="#sec-19">19. EMMC NOSYNC mode: SQLITE_NO_SYNC (sqlite3.c)</a></li>
<li><a href="#sec-20">20. ATOMIC_WRITE mode (k900)</a>
<ul>
<li><a href="#sec-20-1">20.1. improve小数据写入性能(&lt;4KB)</a></li>
<li><a href="#sec-20-2">20.2. external/sqlite</a></li>
</ul>
</li>
<li><a href="#sec-21">21. adjust LMK adj for laucher to avoid kill when low memory</a>
<ul>
<li><a href="#sec-21-1">21.1. when a activity is launched, laucher is switched to BG activity, and maybe killed by LMK in system low memory condition</a></li>
<li><a href="#sec-21-2">21.2. frameworks/base</a></li>
</ul>
</li>
<li><a href="#sec-22">22. adjust long press time from 500ms to 350-400ms (ref 240ms)</a>
<ul>
<li><a href="#sec-22-1">22.1. frameworks/base</a></li>
</ul>
</li>
<li><a href="#sec-23">23. reduce settings  memory usage</a>
<ul>
<li><a href="#sec-23-1">23.1. settings app lauch slow</a></li>
<li><a href="#sec-23-2">23.2. packages/apps/Settings</a></li>
</ul>
</li>
<li><a href="#sec-24">24. key third party app optimize</a>
<ul>
<li><a href="#sec-24-1">24.1. 对常见未开启硬件加速app强制开启，保证帧率</a></li>
<li><a href="#sec-24-2">24.2. frameworks/base</a></li>
</ul>
</li>
<li><a href="#sec-25">25. boot app lauch by temporary change cpu sched policy</a>
<ul>
<li><a href="#sec-25-1">25.1. qcom change cpu policy to interactive and online core = 2, mtk plug on multi-core and keep for several seconds (need customization by project)</a></li>
<li><a href="#sec-25-2">25.2. <span class="todo TODO">TODO</span> kernel/msm</a></li>
<li><a href="#sec-25-3">25.3. <span class="todo TODO">TODO</span> frameworks/native</a></li>
<li><a href="#sec-25-4">25.4. <span class="todo TODO">TODO</span> frameworks/base</a></li>
</ul>
</li>
<li><a href="#sec-26">26. low power: adjust cpu sched policy to achieve balance of power and performance</a>
<ul>
<li><a href="#sec-26-1">26.1. CPU限频方案，针对不同场景制定合适的频率策略</a></li>
<li><a href="#sec-26-2">26.2. frameworks/base</a></li>
</ul>
</li>
<li><a href="#sec-27">27. touch false alarm in the edge, filter in touch driver</a>
<ul>
<li><a href="#sec-27-1">27.1. 窄边框边缘误触</a></li>
<li><a href="#sec-27-2">27.2. kernel/msm</a></li>
</ul>
</li>
<li><a href="#sec-28">28. 通话界面启动速度</a></li>
<li><a href="#sec-29">29. boost first time app lauch</a>
<ul>
<li><a href="#sec-29-1">29.1. frameworks/base</a></li>
</ul>
</li>
<li><a href="#sec-30">30. switch animation</a></li>
<li><a href="#sec-31">31. screen off gesture</a></li>
<li><a href="#sec-32">32. screen off camera</a></li>
<li><a href="#sec-33">33. linaro toolchain update</a>
<ul>
<li><a href="#sec-33-1">33.1. linux-arm-androideabi-4.8-linaro</a></li>
</ul>
</li>
<li><a href="#sec-34">34. qcom improve orientation change perf</a>
<ul>
<li><a href="#sec-34-1">34.1. kernel/msm</a></li>
</ul>
</li>
<li><a href="#sec-35">35. opengl parameter tuning</a>
<ul>
<li><a href="#sec-35-1">35.1. tuning</a></li>
<li><a href="#sec-35-2">35.2. frameworks/base</a></li>
</ul>
</li>
<li><a href="#sec-36">36. touch FW (landlock distance tuning)</a></li>
<li><a href="#sec-37">37. config zram size to balance perf/function</a></li>
<li><a href="#sec-38">38. DRAM turbo mode (risky)</a></li>
<li><a href="#sec-39">39. improve input event response by change cpu freq</a>
<ul>
<li><a href="#sec-39-1">39.1. cpu/gpu provile in certain context</a></li>
<li><a href="#sec-39-2">39.2. kernel/msm</a></li>
</ul>
</li>
<li><a href="#sec-40">40. neon in skia bionic memcpy</a></li>
<li><a href="#sec-41">41. [PCR-117]low power</a>
<ul>
<li><a href="#sec-41-1">41.1. push app list to devcie is possible</a></li>
<li><a href="#sec-41-2">41.2. frameworks/base</a></li>
</ul>
</li>
<li><a href="#sec-42">42. [PCR-118]non-linear backlight</a>
<ul>
<li><a href="#sec-42-1">42.1. kernel/msm</a></li>
</ul>
</li>
<li><a href="#sec-43">43. [PCR-120]boost camera lauch</a>
<ul>
<li><a href="#sec-43-1">43.1. kernel/msm</a></li>
</ul>
</li>
<li><a href="#sec-44">44. [PCR-123] cpu freq limit according to cpu thermal sensor</a>
<ul>
<li><a href="#sec-44-1">44.1. vendor/qcom-proprietary</a></li>
</ul>
</li>
<li><a href="#sec-45">45. [PCR-124] dalvik GC threshold</a></li>
<li><a href="#sec-46">46. [PCR-160] touch feedback</a>
<ul>
<li><a href="#sec-46-1">46.1. frameworks/base</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="http://work.lenovo.com/issue/browse/PCR">http://work.lenovo.com/issue/browse/PCR</a>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">id</th>
<th scope="col" class="left">class</th>
<th scope="col" class="left">summary</th>
<th scope="col" class="left">platform</th>
<th scope="col" class="left">status</th>
<th scope="col" class="left">accept?</th>
<th scope="col" class="left">submit?</th>
<th scope="col" class="left">review</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="left">dram size</td>
<td class="left">ZRAM/KSM</td>
<td class="left">8794</td>
<td class="left">valid</td>
<td class="left">TBD</td>
<td class="left">&#xa0;</td>
<td class="left">small dram size project</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">2</td>
<td class="left">boot time</td>
<td class="left">multi-thread to scan package; increase GC threshold</td>
<td class="left">mtk &amp; 8794</td>
<td class="left">valid</td>
<td class="left">Yes</td>
<td class="left">no</td>
<td class="left">verify on k9 ?</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">3</td>
<td class="left">perf</td>
<td class="left">app switch time with 空灵触控：fixed by app</td>
<td class="left">&#xa0;</td>
<td class="left">invalid</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">app bug &amp; fixed, ignore</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">4</td>
<td class="left">touch</td>
<td class="left">list view scroll too short distance: SCROLL_FRICTION/TOUCH_SLOP</td>
<td class="left">common</td>
<td class="left">valid</td>
<td class="left">TBD</td>
<td class="left">&#xa0;</td>
<td class="left">customize according to sceen size and 阻尼系数</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">5</td>
<td class="left">benchmark</td>
<td class="left">Antutu: cheating by gpu/cpu performance mode when detect antutu</td>
<td class="left">mtk &amp; 8794</td>
<td class="left">valid</td>
<td class="left">TBD</td>
<td class="left">no</td>
<td class="left">qcom add new Performance interface in framework</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">6</td>
<td class="left">audio</td>
<td class="left">BT A2DP when suspend (adjust cpu schedule policy)</td>
<td class="left">common</td>
<td class="left">valid</td>
<td class="left">No</td>
<td class="left">no</td>
<td class="left">side effect on power, patch only if with same bug</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">7</td>
<td class="left">call</td>
<td class="left">incoming call</td>
<td class="left">common</td>
<td class="left">valid</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">L call app may not suffer the problem</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">8</td>
<td class="left">suspend</td>
<td class="left">resume from suspend and light screen</td>
<td class="left">qcom</td>
<td class="left">valid</td>
<td class="left">Yes</td>
<td class="left">partial</td>
<td class="left">reduce delay in setup hw registers, and some dsi config?</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">9</td>
<td class="left">dram</td>
<td class="left">LMK parameter adjust</td>
<td class="left">common</td>
<td class="left">invalid</td>
<td class="left">Yes</td>
<td class="left">yes</td>
<td class="left">12/256/512 used for k9</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">10</td>
<td class="left">boot</td>
<td class="left">broadcast slow at boot up time</td>
<td class="left">common</td>
<td class="left">invalid</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">google fix this problem,</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">11</td>
<td class="left">boot</td>
<td class="left">broadcast slow at boot up time (dup)</td>
<td class="left">common</td>
<td class="left">dup</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">12</td>
<td class="left">ui</td>
<td class="left">volumn button hard to use</td>
<td class="left">&#xa0;</td>
<td class="left">invalid</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">not perf issue, ignore</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">13</td>
<td class="left">boot time</td>
<td class="left">factory mode boot up time : remove selinux(restorecon_xxx("/sys"")</td>
<td class="left">mtk only</td>
<td class="left">valid</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">qcom do not need this</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">14</td>
<td class="left">app crash</td>
<td class="left">app freeze: expand default binder buffer size by 128KB</td>
<td class="left">common</td>
<td class="left">valid</td>
<td class="left">No</td>
<td class="left">no</td>
<td class="left">not merge if no failure</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">15</td>
<td class="left">dram</td>
<td class="left">adjust vmalloc threshold to avoid vmalloc fail</td>
<td class="left">common</td>
<td class="left">valid</td>
<td class="left">No</td>
<td class="left">no</td>
<td class="left">not merge if no vmalloc fail</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">16</td>
<td class="left">boot time</td>
<td class="left">raise the preload GC threshold to avoid frequent GC (dup)</td>
<td class="left">common</td>
<td class="left">dup</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">17</td>
<td class="left">boot time</td>
<td class="left">boost first time bootup with LOCAL_DEX_PREOPT (odex, user load)</td>
<td class="left">common</td>
<td class="left">valid</td>
<td class="left">TBD</td>
<td class="left">&#xa0;</td>
<td class="left">ART</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">18</td>
<td class="left">media</td>
<td class="left">galary database update too slow after sd swap</td>
<td class="left">common</td>
<td class="left">valid</td>
<td class="left">Yes</td>
<td class="left">partial</td>
<td class="left">jcommand to rm media dbs, retest with k9?</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">19</td>
<td class="left">database</td>
<td class="left">EMMC NOSYNC mode: SQLITE_NO_SYNC (sqlite3.c)</td>
<td class="left">common</td>
<td class="left">invalid</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">for poor emmc</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">20</td>
<td class="left">database</td>
<td class="left">ATOMIC_WRITE mode (k900)</td>
<td class="left">common</td>
<td class="left">valid</td>
<td class="left">Yes</td>
<td class="left">no</td>
<td class="left">merge after verify with k9</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">21</td>
<td class="left">launcher</td>
<td class="left">adjust LMK adj for laucher to avoid kill when low memory</td>
<td class="left">common</td>
<td class="left">invalid</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">useful for small memory devices</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">22</td>
<td class="left">touch</td>
<td class="left">adjust long press time from 500ms to 350-400ms (ref 240ms)</td>
<td class="left">common</td>
<td class="left">valid</td>
<td class="left">TBD</td>
<td class="left">&#xa0;</td>
<td class="left">behavior, not perf issue</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">23</td>
<td class="left">settings</td>
<td class="left">reduce settings  memory usage</td>
<td class="left">common</td>
<td class="left">invalid</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">for small memory devices</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">24</td>
<td class="left">3rd app</td>
<td class="left">improve key 3rd party app perf with HW_accel</td>
<td class="left">common</td>
<td class="left">valid</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">check top 3rd party app default enable hw_accl</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">25</td>
<td class="left">app lauch</td>
<td class="left">temperary adjust cpu sched policy to boost app launch</td>
<td class="left">common</td>
<td class="left">valid</td>
<td class="left">Yes</td>
<td class="left">no</td>
<td class="left">merge after verify on k9</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">26</td>
<td class="left">low power</td>
<td class="left">adjust cpu sched policy (set cpu freq limit according to app list)</td>
<td class="left">common</td>
<td class="left">valid</td>
<td class="left">No</td>
<td class="left">no</td>
<td class="left">impact user experience, not recommend on high-end device</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">27</td>
<td class="left">touch</td>
<td class="left">false alarm in edge, touch driver filter</td>
<td class="left">common</td>
<td class="left">valid</td>
<td class="left">TBD</td>
<td class="left">&#xa0;</td>
<td class="left">not perf issue</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">28</td>
<td class="left">app</td>
<td class="left">calling app perf</td>
<td class="left">common</td>
<td class="left">invalid</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">implement in app, not perf issue</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">29</td>
<td class="left">app lauch</td>
<td class="left">[PCR-25]boost first time app lauch(no screenshot for home screen)</td>
<td class="left">common</td>
<td class="left">valid</td>
<td class="left">Yes</td>
<td class="left">no</td>
<td class="left">include in PCR-25</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">30</td>
<td class="left">animation</td>
<td class="left">switch animation</td>
<td class="left">common</td>
<td class="left">invalid</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">not perf issue</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">31</td>
<td class="left">gesture</td>
<td class="left">improve gesture performance in screen off mode</td>
<td class="left">common</td>
<td class="left">invalid</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">no code</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">32</td>
<td class="left">camera</td>
<td class="left">boost camera start up flow in screen off mode</td>
<td class="left">common</td>
<td class="left">invalid</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">no code</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">33</td>
<td class="left">toolchain</td>
<td class="left">gcc-4.8-linaro, -O2, neon-vfp4 (stability issue)</td>
<td class="left">common</td>
<td class="left">invalid</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">no code</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">34</td>
<td class="left">orientation</td>
<td class="left">qcom improve orientation change perf</td>
<td class="left">qcom</td>
<td class="left">invalid</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">qcom driver include the patch</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">35</td>
<td class="left">display</td>
<td class="left">opengl tuning</td>
<td class="left">common</td>
<td class="left">valid</td>
<td class="left">Y</td>
<td class="left">no</td>
<td class="left">need customization</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">36</td>
<td class="left">touch</td>
<td class="left">touch FW (landlock distance tuning)</td>
<td class="left">common</td>
<td class="left">invalid</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">FW, not SW</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">37</td>
<td class="left">dram</td>
<td class="left">config zram size to balance perf/function</td>
<td class="left">common</td>
<td class="left">invalid</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">small memory devices only</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">38</td>
<td class="left">dram</td>
<td class="left">DRAM turbo mode (risky)</td>
<td class="left">common</td>
<td class="left">invalid</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">stability issue</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">39</td>
<td class="left">input</td>
<td class="left">improve input event response by change cpu freq</td>
<td class="left">common</td>
<td class="left">valid</td>
<td class="left">Yes</td>
<td class="left">&#xa0;</td>
<td class="left">qcom new Performance api support this ?</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">40</td>
<td class="left">perf</td>
<td class="left">neon in skia/bionic memcpy</td>
<td class="left">mtk</td>
<td class="left">valid</td>
<td class="left">Yes</td>
<td class="left">&#xa0;</td>
<td class="left">no code</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">117</td>
<td class="left">low power</td>
<td class="left">same as PCR-26</td>
<td class="left">common</td>
<td class="left">dup</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">118</td>
<td class="left">display</td>
<td class="left">non-linear backlight</td>
<td class="left">common</td>
<td class="left">valid</td>
<td class="left">TBD</td>
<td class="left">&#xa0;</td>
<td class="left">not perf issue</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">119</td>
<td class="left">low power</td>
<td class="left">same as PCR-26</td>
<td class="left">&#xa0;</td>
<td class="left">dup</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">120</td>
<td class="left">camera</td>
<td class="left">boost camera lauch</td>
<td class="left">qcom, mtk</td>
<td class="left">valid</td>
<td class="left">Yes</td>
<td class="left">yes</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">123</td>
<td class="left">low power</td>
<td class="left">limit cpu freq according to thermal</td>
<td class="left">qcom</td>
<td class="left">valid</td>
<td class="left">Yes</td>
<td class="left">no</td>
<td class="left">need verify on k9</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">124</td>
<td class="left">dalvik</td>
<td class="left">GC threshold</td>
<td class="left">mtk</td>
<td class="left">dup</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">no code</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">125</td>
<td class="left">wifi</td>
<td class="left">wifi RTS threshold 2347-&gt;2346</td>
<td class="left">common</td>
<td class="left">new</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">127</td>
<td class="left">wifi</td>
<td class="left">wifi ST enhance</td>
<td class="left">common</td>
<td class="left">new</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">133</td>
<td class="left">home</td>
<td class="left">return to home screen slow (reduce snapshot operation 2-&gt;1)</td>
<td class="left">common</td>
<td class="left">valid</td>
<td class="left">Yes</td>
<td class="left">no</td>
<td class="left">no code</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">141</td>
<td class="left">perf</td>
<td class="left">From PCR-10, a VIP broadcast channel</td>
<td class="left">&#xa0;</td>
<td class="left">dup</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">142</td>
<td class="left">display</td>
<td class="left">resume and display light up 600ms</td>
<td class="left">&#xa0;</td>
<td class="left">dup</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">143</td>
<td class="left">display</td>
<td class="left">PCR-8: resume and display light up (optimize to 300ms)</td>
<td class="left">&#xa0;</td>
<td class="left">dup</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">144</td>
<td class="left">perf</td>
<td class="left">PCR-14/15</td>
<td class="left">common</td>
<td class="left">dup</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">146</td>
<td class="left">wifi</td>
<td class="left">wifi signal strength</td>
<td class="left">&#xa0;</td>
<td class="left">new</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">147</td>
<td class="left">perf</td>
<td class="left">PCR-141</td>
<td class="left">&#xa0;</td>
<td class="left">new</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">154</td>
<td class="left">BT a2dp</td>
<td class="left">PCR-6</td>
<td class="left">&#xa0;</td>
<td class="left">dup</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">156</td>
<td class="left">display</td>
<td class="left">PCR-35</td>
<td class="left">&#xa0;</td>
<td class="left">dup</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">160</td>
<td class="left">touch</td>
<td class="left">touch feedback</td>
<td class="left">&#xa0;</td>
<td class="left">new</td>
<td class="left">N</td>
<td class="left">&#xa0;</td>
<td class="left">not perf issue</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
