fancy_pcr.org
* zram/ksm

** memory low after long time usage

** for android version above 4.2 and small dram devices

** ksm -> 开机时配置扫描页数和频率，zram -> 开机建立和挂载swap分区供压缩

** kernel/msm
arch/arm/configs/msm8974_defconfig
#+BEGIN_SRC sh
+CONFIG_SWAP=y
+CONFIG_ZRAM=y
+CONFIG_ZRAM_DEBUG=y
+CONFIG_ZSMALLOC=y
+CONFIG_KSM=y
#+END_SRC

** vendor/qcom/copper
AndroidBoard.mk
#+BEGIN_SRC sh
+#include $(CLEAR_VARS)
+LOCAL_MODULE := fstab.zram
+LOCAL_MODULE_TAGS := optional
+LOCAL_MODULE_CLASS := ETC
+LOCAL_SRC_FILES := $(LOCAL_MODULE)
+LOCAL_MODULE_PATH := $(TARGET_ROOT_OUT)
+include $(BUILD_PREBUILT)
#+END_SRC

fstab.zram
#+BEGIN_SRC sh
+/dev/block/zram0 none swap defaults zramsize=1073741824
#+END_SRC

init.target.rc
#+BEGIN_SRC sh
on fs
 mount_all fstab.qcom
+swapon_all fstab.zram
+write /proc/sys/vm/swappiness 100
+write /sys/kernel/mm/ksm/pages_to_scan 100
+write /sys/kernel/mm/ksm/sleep_millisecs 500
+write /sys/kernel/mm/ksm/run 1
#+END_SRC

msm8974.mk
#+BEGIN_SRC sh
+PRODUCT_PACKAGES += fstab.zram
#+END_SRC

* boot: boot time

** long boot time in normal boot

** multi-thread to scan package; increase GC threshold

** frameworks/base
core/java/com/android/internal/os/ZygoteInit.java
#+BEGIN_SRC java
-private static final int PRELOAD_GC_THRESHOLD = 50000;
+private static final int PRELOAD_GC_THRESHOLD = 500000;
#+END_SRC

services/java/com/android/server/pm/Installer.java

services/java/com/android/server/pm/PackageManagerService.java

** frameworks/native
cmds/installd/installd.c/.h

*** TODO change too much and different on L, not reviewed

* touch: list view scroll too slow

** 手指滑动相同距离，列表滚动距离短

** frameworks/base
core/java/android/view/view/ViewConfiguration.java
#+BEGIN_SRC java
private static final int TOUCH_SLOP = 8 -> 5;
private static final float SCROLL_FRICTION = 0.015f -> 0x011f;
#+END_SRC

core/res/res/values/config.xml
#+BEGIN_SRC xml
<dimen name="config_viewConfigurationTouchSlop">8dp</dimen> -> 5dp
#+END_SRC

*** TODO need customize according to screen characteristics


* app swith

** ignore (app fix)


* benchmark: antutu

** cheat by cpu/gpu performance mode when detect benchmark app (improve benchmark by 1000-2500)

** hacking method

- activity 运行时检测包名，antutu->performance mode, activity 切后台/退出时，恢复。
- hotplug mode -> performance mode
  - cpu governor set to performance
  - disable DVFS
  - all cpu plug on, high freq
  - gpu loading_threshold 100%, freq (mali)
  - disable thermal
- performance mode -> hotplug mode
  - cpu governor set to hotplug
  - enable DVFS
  - gpu loading_threshold 80%, freq(DVFS)
  - enable thermal

** frameworks/base
services/java/com/android/server/am/ActivityManagerService.java
#+begin_src java
private final void handleAppDiedLocked(Process Record app,
	boolean restarting, boolean allowRestart) {
+	if (null != app.info.packageName && app.info.packageName.contains(mStackSupervisor.getPackageName())) {
		String str = mStackSupervisor.readSysFile(mStackSupervisor.mCpuFreqFilePath, '\0');
		if (!TextUtils.isEmpty(str) && (str.trim().compareTo("41") == 0 ? true : false)) {
			mStackSupervisor.writeSysFile("0", mStackSupervisor.mCpuFreqFilePath);
			mStackSupervisor.mSetCpuFreqMark = 1;
		}
+	}
}
#+end_src

services/java/com/android/server/am/ActivityStackSupervisor.java

#+begin_src java
+package int mSetFreqMark = 1;
+String mCpuFreqFilePath = "/sys/devices/system/cpu/cpu0/rq-stats/mpctl";
+private int mPackageName[] = {0xc6, 0xde, 0xda, 0x5c, 0xc2, 0xdc, 0xe8, 0xea, 0xe8, 0xea};

final ActivityRecord acitvityIdleInternalLocked(final IBinder token, boolean from Timeout,
Configuration config) {
+	if (null != r.packageName) {
		if (r.packageName.contains(getPackageName())) {
			if (mSetCpuFreqMark != 0) {
				String str = readSysFile(mCpuFreqFilePath, '\0');
				if (!TextUtils.isEmpty(str) && str.trim().compareTo("0") == 0 ? true : false))
					writeSysFile("41", mCpuFreqFilePath);
				mSetCpuFreqMark = 0;
		} else {
			if (mSetCpuFreqMark != 1) {
				String str = readSysFile(mCpuFreqFilePath, '\0');
				if (!TextUtils.isEmpty(str) && str.trim().compareTo("41") == 0 ? true : false))
					writeSysFile("0", mCpuFreqFilePath);
				mSetCpuFreqMark = 0;
		}
+	}
}

void writeSysFile(String values, String filePath) {
...;
}

String readSysFile(String file, char endChar) {
...;
}

String getPackageName() {
...;
}
#+end_src

+ sc.lenovo.com:8080/#/c/270787/

