data/60/950ec2-44bb-4f19-b53b-bd7dcd17ef3f/fancy_pcr.html


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> zram/ksm</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> memory low after long time usage</h3>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> for android version above 4.2 and small dram devices</h3>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> ksm -&gt; 开机时配置扫描页数和频率，zram -&gt; 开机建立和挂载swap分区供压缩</h3>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> kernel/msm</h3>
<div class="outline-text-3" id="text-1-4">
<p>
arch/arm/configs/msm8974_defconfig
</p>
<div class="org-src-container">

<pre class="src src-sh">+CONFIG_SWAP=y
+CONFIG_ZRAM=y
+CONFIG_ZRAM_DEBUG=y
+CONFIG_ZSMALLOC=y
+CONFIG_KSM=y
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> vendor/qcom/copper</h3>
<div class="outline-text-3" id="text-1-5">
<p>
AndroidBoard.mk
</p>
<div class="org-src-container">

<pre class="src src-sh">+#include $(CLEAR_VARS)
+LOCAL_MODULE := fstab.zram
+LOCAL_MODULE_TAGS := optional
+LOCAL_MODULE_CLASS := ETC
+LOCAL_SRC_FILES := $(LOCAL_MODULE)
+LOCAL_MODULE_PATH := $(TARGET_ROOT_OUT)
+include $(BUILD_PREBUILT)
</pre>
</div>

<p>
fstab.zram
</p>
<div class="org-src-container">

<pre class="src src-sh">+/dev/block/zram0 none swap defaults zramsize=1073741824
</pre>
</div>

<p>
init.target.rc
</p>
<div class="org-src-container">

<pre class="src src-sh">on fs
 mount_all fstab.qcom
+swapon_all fstab.zram
+write /proc/sys/vm/swappiness 100
+write /sys/kernel/mm/ksm/pages_to_scan 100
+write /sys/kernel/mm/ksm/sleep_millisecs 500
+write /sys/kernel/mm/ksm/run 1
</pre>
</div>

<p>
msm8974.mk
</p>
<div class="org-src-container">

<pre class="src src-sh">+PRODUCT_PACKAGES += fstab.zram
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> boot: boot time</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> long boot time in normal boot</h3>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> multi-thread to scan package; increase GC threshold</h3>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> frameworks/base</h3>
<div class="outline-text-3" id="text-2-3">
<p>
core/java/com/android/internal/os/ZygoteInit.java
</p>
<div class="org-src-container">

<pre class="src src-java">-private static final int PRELOAD_GC_THRESHOLD = 50000;
+private static final int PRELOAD_GC_THRESHOLD = 500000;
</pre>
</div>

<p>
services/java/com/android/server/pm/Installer.java
</p>

<p>
services/java/com/android/server/pm/PackageManagerService.java
</p>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> frameworks/native</h3>
<div class="outline-text-3" id="text-2-4">
<p>
cmds/installd/installd.c/.h
</p>
</div>

<div id="outline-container-sec-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> <span class="todo TODO">TODO</span> change too much and different on L, not reviewed</h4>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> touch: list view scroll too slow</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 手指滑动相同距离，列表滚动距离短</h3>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> frameworks/base</h3>
<div class="outline-text-3" id="text-3-2">
<p>
core/java/android/view/view/ViewConfiguration.java
</p>
<div class="org-src-container">

<pre class="src src-java">private static final int TOUCH_SLOP = 8 -&gt; 5;
private static final float SCROLL_FRICTION = 0.015f -&gt; 0x011f;
</pre>
</div>

<p>
core/res/res/values/config.xml
</p>
<div class="org-src-container">

<pre class="src src-xml">&lt;dimen name="config_viewConfigurationTouchSlop"&gt;8dp&lt;/dimen&gt; -&gt; 5dp
</pre>
</div>
</div>

<div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> <span class="todo TODO">TODO</span> need customize according to screen characteristics</h4>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> app swith</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> ignore (app fix)</h3>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> benchmark: antutu</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> cheat by cpu/gpu performance mode when detect benchmark app (improve benchmark by 1000-2500)</h3>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> hacking method</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>activity 运行时检测包名，antutu-&gt;performance mode, activity 切后台/退出时，恢复。
</li>
<li>hotplug mode -&gt; performance mode
<ul class="org-ul">
<li>cpu governor set to performance
</li>
<li>disable DVFS
</li>
<li>all cpu plug on, high freq
</li>
<li>gpu loading_threshold 100%, freq (mali)
</li>
<li>disable thermal
</li>
</ul>
</li>
<li>performance mode -&gt; hotplug mode
<ul class="org-ul">
<li>cpu governor set to hotplug
</li>
<li>enable DVFS
</li>
<li>gpu loading_threshold 80%, freq(DVFS)
</li>
<li>enable thermal
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> frameworks/base</h3>
<div class="outline-text-3" id="text-5-3">
<p>
services/java/com/android/server/am/ActivityManagerService.java
</p>
<div class="org-src-container">

<pre class="src src-java">private final void handleAppDiedLocked(Process Record app,
	boolean restarting, boolean allowRestart) {
+       if (null != app.info.packageName &amp;&amp; app.info.packageName.contains(mStackSupervisor.getPackageName())) {
		String str = mStackSupervisor.readSysFile(mStackSupervisor.mCpuFreqFilePath, '\0');
		if (!TextUtils.isEmpty(str) &amp;&amp; (str.trim().compareTo("41") == 0 ? true : false)) {
			mStackSupervisor.writeSysFile("0", mStackSupervisor.mCpuFreqFilePath);
			mStackSupervisor.mSetCpuFreqMark = 1;
		}
+       }
}
</pre>
</div>

<p>
services/java/com/android/server/am/ActivityStackSupervisor.java
</p>

<div class="org-src-container">

<pre class="src src-java">+package int mSetFreqMark = 1;
+String mCpuFreqFilePath = "/sys/devices/system/cpu/cpu0/rq-stats/mpctl";
+private int mPackageName[] = {0xc6, 0xde, 0xda, 0x5c, 0xc2, 0xdc, 0xe8, 0xea, 0xe8, 0xea};

final ActivityRecord acitvityIdleInternalLocked(final IBinder token, boolean from Timeout,
Configuration config) {
+       if (null != r.packageName) {
		if (r.packageName.contains(getPackageName())) {
			if (mSetCpuFreqMark != 0) {
				String str = readSysFile(mCpuFreqFilePath, '\0');
				if (!TextUtils.isEmpty(str) &amp;&amp; str.trim().compareTo("0") == 0 ? true : false))
					writeSysFile("41", mCpuFreqFilePath);
				mSetCpuFreqMark = 0;
		} else {
			if (mSetCpuFreqMark != 1) {
				String str = readSysFile(mCpuFreqFilePath, '\0');
				if (!TextUtils.isEmpty(str) &amp;&amp; str.trim().compareTo("41") == 0 ? true : false))
					writeSysFile("0", mCpuFreqFilePath);
				mSetCpuFreqMark = 0;
		}
+       }
}

void writeSysFile(String values, String filePath) {
...;
}

String readSysFile(String file, char endChar) {
...;
}

String getPackageName() {
...;
}
</pre>
</div>

<ul class="org-ul">
<li>sc.lenovo.com:8080/#/c/270787/
</li>
</ul>
</div>
</div>
