fancy_pcr.org
** TODO [#A] qcom has add a common Performance api(perflock) in framework laywer in L

[ro.vendor.extension_library]: [libqti-perfd-client.so]

frameworks/base/core/res/res/values/config.xml

#+begin_src xml
    <!-- Whether cpu boost is enabled for overscroller fling. -->
    <bool name="config_enableCpuBoostForOverScrollerFling">false</bool>
    <integer name="flingboost_timeout_param">0</integer>
    <integer name="flingboost_schedboost_param">0</integer>
    <integer name="flingboost_cpuboost_param">0</integer>
    <integer name="flingboost_pcdisbl_param">0</integer>
    <integer name="flingboost_ksmboost_param">0</integer>

    <!-- Whether cpu boost is enabled for horizontal scroll. -->
    <bool name="config_enableCpuBoostForScroller">false</bool>
    <integer name="scrollboost_timeout_param">0</integer>
    <integer name="scrollboost_schedboost_param">0</integer>
    <integer name="scrollboost_cpuboost_param">0</integer>
    <integer name="scrollboost_pcdisbl_param">0</integer>
    <integer name="scrollboost_ksmboost_param">0</integer>

    <!-- Configuration to enable non-default PDP during IWLAN -->
    <bool name="config_feature_iwlan_enabled">false</bool>
    <!-- set to false if we dont need to consider data
         service state to display signal strength bars -->
    <bool name="config_combined_signal">true</bool>

    <!-- Whether cpu boost is enabled for both application's 1st launch,subsequent
         launch and in-app-activity -->
    <bool name="config_enableCpuBoostForAppLaunch">false</bool>
    <integer name="launchboost_timeout_param">0</integer>
    <integer name="launchboost_schedboost_param">0</integer>
    <integer name="launchboost_cpuboost_param">0</integer>
    <integer name="launchboost_cpu_6_7_offline_param">0</integer>
    <integer name="launchboost_pcdisbl_param">0</integer>
    <integer name="launchboost_ksmboost_param">0</integer>
#+end_src

* BT A2DP when suspend

** 灭屏状态音乐卡顿

** 蓝牙耳机播放音乐，cpu在灭屏状态使用2 core, 音乐停止，让cpu恢复灭屏single core default setting.

** external/bluetooth/bluedroid
audio_a2dp_hw/audio_a2dp_hw.c
#+begin_src c
#define A2DP_CTRL_PROPERTY "audio.a2dp.status"

+static  void a2dp_cpu_ctrl(int stats)
{
	if (stats)
		property_set(A2DP_CTRL_PROPERTY, "play");
	else
		property_set(A2DP_CTRL_PROPERTY, "stop");
}

static int start_audio_datapathh(struct a2dp_stream_out *out)
{
+ 	a2dp_cpu_ctrl(true);
}

statuc int stop_audio_datapath(struct a2dp_stream_out *out)
{
+	a2dp_cpu_ctrl(false);
}
#+end_src

** system/core
init/property_service.c
#+begin_src c
+{ "audio.a2dp.", AID_MEDIA, 0},
#+end_src

** vendor/qcom-proprietary
mpdecision/decision.c
#+begin_src c
+static int display_on = 1;
+static int bt_play = 0;

int mpdecision_lock_min_cores(int min)
{
+	pthread_mutex_lock(&hotplug_mutex);
	display_on = min > 1 ? 1 : 0;
	if (!display_on && bt_play) {
		pthread_mutex_unlock(&hotplug_mutex);
		do_lock_min_cores(2);
	} else if (display_on && lock_lock_min_cores == 2) {
		pthread_mutex_unlock(&hotplug_mutex);
		do_lock_min_cores(1);
	} else
+		pthread_mutex_unlock(&hotplug_mutex);
}

static void *do_perf_monitor(void *data)
{
-	int core_num = cmd / 10;
-	int governor = cmd % 10;
+	int core_num, governor;
	if (cmd > 100) {
		bt_play = 2 - cmd / 100;
		cmd = cmd % 100;
	}
	core_num = cmd / 10;
+	governor = cmd % 10;

	if (core_num > 0) {
		if (core_num > num_cpus)
			core_num = num_cpus;
+		pthread_mutex_lock(&hotplug_mutex);
		if (!display_on && bt_play)
			if (core_num < 2)
				core_num = 2;
		else if (display_on && bt_play)
			core_num = 1;
+		pthread_mutex_lock(&hotplug_mutex);
		do_lock_min_cores(core_num);
	}
#+end_src

** device/qcom/common
rootdir/etc/init.qcom.rc
#+begin_src sh
on property:audio.a2dp.status=play
	write /sys/devices/system/cpu/cpu0/rq-stats/mpctl 122

on property:audio.a2dp.status=stop
	write /sys/devices/system/cpu/cpu0/rq-stats/mpctl 212
#+end_src

* call app: incoming call response

** 待机来电亮屏时间，提高响铃和页面显示的同步性

** 通话界面显示的逻辑优化，UI加载的时间优化，平衡来电铃音，亮屏速度与锁屏界面处理时机等，理论上缩短时间300-500ms.

** packages/apps/LenovoTeleservice

src/com/android/phone/CallController.java

src/com/android/phone/ErrorDialogActivity.java
src/com/android/phone/OutgoingCallBroadcaster.java
src/com/android/phone/PhoneUtils.java
src/com/android/phone/msim/MSimCallNotifier.java

* resume from suspend (screen light up)

** 优化亮屏速度 （使用双MIPI DSI方案的平台）
qcom原来的实现方式对每个DSI实现一次初始化，包含GPIO设置和延时，修改后，LCD reset和上电只做一次，延时也只做一次，节省LCD初始化时间。优化2K屏的DSI多通道多余操作，使得driver层的各项执行时间减少

** kernel/msm
*** TODO arch/arm/boot/dts/msm8974-mdss.dtsi
#+begin_src sh
mdss_dsi0:qcom,mdss_dsi@fd922800 {
- 	qcom,platform-supply-entry1;
   	qcom,platform-supply-entry2;
	qcom,platform-supply-entry3;
	
-mdss_dsi1: qcom,mdss_dsi@fd922e00 {};
#+end_src

*** DONE drivers/video/msm/mdss/mdss_dsi.c
#+begin_src c
gpio_direction_output(ctrl_pdata->disp_vsp_gpio, 1);
- msleep(1);
+ udelay(100);
wmb();
gpio_direction_output(ctrl_pdata->disp_vsn_gpio, 1);
-sleep(20);
+msleep(4);
#+end_src

*** DONE drivers/vidio/msm/mdss/mdss_dsi_panel.c
#+begin_src c
- gpio_set_value((ctrl_pdata->rst_gpio), 1);
- msleep(20);
+ if(gpio_is_valid(ctrl_pdata->rst_gpio)) {
+ 	gpio_set_value((ctrl_pdata->rst_gpio), 1);
+	msleep(10);
+ }
#+end_src

*** TODO drivers/video/msm/mdss/mdss_r63319.h
#+begin_src c
static char ultra_mode_cmd0[] = {0x55, 0x73}; //old {0x55, 0x03}
static char ultra_mode_cmd1[] = {0xca, 0x01, 0x80, 0xf0, 0xf0, 0xf0, 0xf0, 0xf0, 0x20, 0x20 ...};
static char ultra_mode_cmd2[] = {0xba, 0x05, 0x3c, 0xff, 0x00, 0x00, 0x00};
static char ultra_mode_cmd3[] = {0xbd, 0x01, 0xb4, 0xa0};
#+end_src

* LMK

** small free dram size (*procrank*)
调整LMK参数，减少应用数量，提高内存回收threshold, 清理非前台应用
** frameworks/native
