data/60/950ec2-44bb-4f19-b53b-bd7dcd17ef3f/fancy_pcr.html

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> <span class="todo TODO">TODO</span> qcom has add a common Performance api(perflock) in framework laywer in L</h3>
<div class="outline-text-3" id="text-5-4">
<p>
[ro.vendor.extension_library]: [libqti-perfd-client.so]
</p>

<p>
frameworks/base/core/res/res/values/config.xml
</p>

<div class="org-src-container">

<pre class="src src-xml">&lt;!-- Whether cpu boost is enabled for overscroller fling. --&gt;
&lt;bool name="config_enableCpuBoostForOverScrollerFling"&gt;false&lt;/bool&gt;
&lt;integer name="flingboost_timeout_param"&gt;0&lt;/integer&gt;
&lt;integer name="flingboost_schedboost_param"&gt;0&lt;/integer&gt;
&lt;integer name="flingboost_cpuboost_param"&gt;0&lt;/integer&gt;
&lt;integer name="flingboost_pcdisbl_param"&gt;0&lt;/integer&gt;
&lt;integer name="flingboost_ksmboost_param"&gt;0&lt;/integer&gt;

&lt;!-- Whether cpu boost is enabled for horizontal scroll. --&gt;
&lt;bool name="config_enableCpuBoostForScroller"&gt;false&lt;/bool&gt;
&lt;integer name="scrollboost_timeout_param"&gt;0&lt;/integer&gt;
&lt;integer name="scrollboost_schedboost_param"&gt;0&lt;/integer&gt;
&lt;integer name="scrollboost_cpuboost_param"&gt;0&lt;/integer&gt;
&lt;integer name="scrollboost_pcdisbl_param"&gt;0&lt;/integer&gt;
&lt;integer name="scrollboost_ksmboost_param"&gt;0&lt;/integer&gt;

&lt;!-- Configuration to enable non-default PDP during IWLAN --&gt;
&lt;bool name="config_feature_iwlan_enabled"&gt;false&lt;/bool&gt;
&lt;!-- set to false if we dont need to consider data
     service state to display signal strength bars --&gt;
&lt;bool name="config_combined_signal"&gt;true&lt;/bool&gt;

&lt;!-- Whether cpu boost is enabled for both application's 1st launch,subsequent
     launch and in-app-activity --&gt;
&lt;bool name="config_enableCpuBoostForAppLaunch"&gt;false&lt;/bool&gt;
&lt;integer name="launchboost_timeout_param"&gt;0&lt;/integer&gt;
&lt;integer name="launchboost_schedboost_param"&gt;0&lt;/integer&gt;
&lt;integer name="launchboost_cpuboost_param"&gt;0&lt;/integer&gt;
&lt;integer name="launchboost_cpu_6_7_offline_param"&gt;0&lt;/integer&gt;
&lt;integer name="launchboost_pcdisbl_param"&gt;0&lt;/integer&gt;
&lt;integer name="launchboost_ksmboost_param"&gt;0&lt;/integer&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> BT A2DP when suspend</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 灭屏状态音乐卡顿</h3>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 蓝牙耳机播放音乐，cpu在灭屏状态使用2 core, 音乐停止，让cpu恢复灭屏single core default setting.</h3>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> external/bluetooth/bluedroid</h3>
<div class="outline-text-3" id="text-6-3">
<p>
audio_a2dp_hw/audio_a2dp_hw.c
</p>
<div class="org-src-container">

<pre class="src src-c">#define A2DP_CTRL_PROPERTY "audio.a2dp.status"

+static  void a2dp_cpu_ctrl(int stats)
{
	if (stats)
		property_set(A2DP_CTRL_PROPERTY, "play");
	else
		property_set(A2DP_CTRL_PROPERTY, "stop");
}

static int start_audio_datapathh(struct a2dp_stream_out *out)
{
+       a2dp_cpu_ctrl(true);
}

statuc int stop_audio_datapath(struct a2dp_stream_out *out)
{
+       a2dp_cpu_ctrl(false);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> system/core</h3>
<div class="outline-text-3" id="text-6-4">
<p>
init/property_service.c
</p>
<div class="org-src-container">

<pre class="src src-c">+{ "audio.a2dp.", AID_MEDIA, 0},
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> vendor/qcom-proprietary</h3>
<div class="outline-text-3" id="text-6-5">
<p>
mpdecision/decision.c
</p>
<div class="org-src-container">

<pre class="src src-c">+static int display_on = 1;
+static int bt_play = 0;

int mpdecision_lock_min_cores(int min)
{
+       pthread_mutex_lock(&amp;hotplug_mutex);
	display_on = min &gt; 1 ? 1 : 0;
	if (!display_on &amp;&amp; bt_play) {
		pthread_mutex_unlock(&amp;hotplug_mutex);
		do_lock_min_cores(2);
	} else if (display_on &amp;&amp; lock_lock_min_cores == 2) {
		pthread_mutex_unlock(&amp;hotplug_mutex);
		do_lock_min_cores(1);
	} else
+               pthread_mutex_unlock(&amp;hotplug_mutex);
}

static void *do_perf_monitor(void *data)
{
-       int core_num = cmd / 10;
-       int governor = cmd % 10;
+       int core_num, governor;
	if (cmd &gt; 100) {
		bt_play = 2 - cmd / 100;
		cmd = cmd % 100;
	}
	core_num = cmd / 10;
+       governor = cmd % 10;

	if (core_num &gt; 0) {
		if (core_num &gt; num_cpus)
			core_num = num_cpus;
+               pthread_mutex_lock(&amp;hotplug_mutex);
		if (!display_on &amp;&amp; bt_play)
			if (core_num &lt; 2)
				core_num = 2;
		else if (display_on &amp;&amp; bt_play)
			core_num = 1;
+               pthread_mutex_lock(&amp;hotplug_mutex);
		do_lock_min_cores(core_num);
	}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> device/qcom/common</h3>
<div class="outline-text-3" id="text-6-6">
<p>
rootdir/etc/init.qcom.rc
</p>
<div class="org-src-container">

<pre class="src src-sh">on property:audio.a2dp.status=play
	write /sys/devices/system/cpu/cpu0/rq-stats/mpctl 122

on property:audio.a2dp.status=stop
	write /sys/devices/system/cpu/cpu0/rq-stats/mpctl 212
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> call app: incoming call response</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> 待机来电亮屏时间，提高响铃和页面显示的同步性</h3>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> 通话界面显示的逻辑优化，UI加载的时间优化，平衡来电铃音，亮屏速度与锁屏界面处理时机等，理论上缩短时间300-500ms.</h3>
</div>

<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> packages/apps/LenovoTeleservice</h3>
<div class="outline-text-3" id="text-7-3">
<p>
src/com/android/phone/CallController.java
</p>

<p>
src/com/android/phone/ErrorDialogActivity.java
src/com/android/phone/OutgoingCallBroadcaster.java
src/com/android/phone/PhoneUtils.java
src/com/android/phone/msim/MSimCallNotifier.java
</p>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> resume from suspend (screen light up)</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> 优化亮屏速度 （使用双MIPI DSI方案的平台）</h3>
<div class="outline-text-3" id="text-8-1">
<p>
qcom原来的实现方式对每个DSI实现一次初始化，包含GPIO设置和延时，修改后，LCD reset和上电只做一次，延时也只做一次，节省LCD初始化时间。优化2K屏的DSI多通道多余操作，使得driver层的各项执行时间减少
</p>
</div>
</div>

<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> kernel/msm</h3>
<div class="outline-text-3" id="text-8-2">
</div><div id="outline-container-sec-8-2-1" class="outline-4">
<h4 id="sec-8-2-1"><span class="section-number-4">8.2.1</span> <span class="todo TODO">TODO</span> arch/arm/boot/dts/msm8974-mdss.dtsi</h4>
<div class="outline-text-4" id="text-8-2-1">
<div class="org-src-container">

<pre class="src src-sh">mdss_dsi0:qcom,mdss_dsi@fd922800 {
-       qcom,platform-supply-entry1;
	qcom,platform-supply-entry2;
	qcom,platform-supply-entry3;

-mdss_dsi1: qcom,mdss_dsi@fd922e00 {};
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-2-2" class="outline-4">
<h4 id="sec-8-2-2"><span class="section-number-4">8.2.2</span> <span class="done DONE">DONE</span> drivers/video/msm/mdss/mdss_dsi.c</h4>
<div class="outline-text-4" id="text-8-2-2">
<div class="org-src-container">

<pre class="src src-c">gpio_direction_output(ctrl_pdata-&gt;disp_vsp_gpio, 1);
- msleep(1);
+ udelay(100);
wmb();
gpio_direction_output(ctrl_pdata-&gt;disp_vsn_gpio, 1);
-sleep(20);
+msleep(4);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-2-3" class="outline-4">
<h4 id="sec-8-2-3"><span class="section-number-4">8.2.3</span> <span class="done DONE">DONE</span> drivers/vidio/msm/mdss/mdss_dsi_panel.c</h4>
<div class="outline-text-4" id="text-8-2-3">
<div class="org-src-container">

<pre class="src src-c">- gpio_set_value((ctrl_pdata-&gt;rst_gpio), 1);
- msleep(20);
+ if(gpio_is_valid(ctrl_pdata-&gt;rst_gpio)) {
+       gpio_set_value((ctrl_pdata-&gt;rst_gpio), 1);
+       msleep(10);
+ }
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-2-4" class="outline-4">
<h4 id="sec-8-2-4"><span class="section-number-4">8.2.4</span> <span class="todo TODO">TODO</span> drivers/video/msm/mdss/mdss_r63319.h</h4>
<div class="outline-text-4" id="text-8-2-4">
<div class="org-src-container">

<pre class="src src-c">static char ultra_mode_cmd0[] = {0x55, 0x73}; //old {0x55, 0x03}
static char ultra_mode_cmd1[] = {0xca, 0x01, 0x80, 0xf0, 0xf0, 0xf0, 0xf0, 0xf0, 0x20, 0x20 ...};
static char ultra_mode_cmd2[] = {0xba, 0x05, 0x3c, 0xff, 0x00, 0x00, 0x00};
static char ultra_mode_cmd3[] = {0xbd, 0x01, 0xb4, 0xa0};
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> LMK</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> small free dram size (<b>procrank</b>)</h3>
<div class="outline-text-3" id="text-9-1">
<p>
调整LMK参数，减少应用数量，提高内存回收threshold, 清理非前台应用
</p>
</div>
</div>
