fancy_pcr.org
*** DONE build/phone-xhdpi-1024-dalvik-heap.mk
#+begin_src sh
dalvik.vm.heapgrowthlimit=192m # old is 96m
dalvik.vm.heapsize=512m # old is 256m
#+end_src
*** TODO why include xhdpi-1024 not xhdpi-2048 for 3GB project(k9)?

* broadcast slow

MTK建立单独的VIP broadcast queue，后来发现是android原生bug, 已经fix.

** frameworks/base
services/java/com/android/server/am/ActivityManagerService.java

* broadcast slow

* volumn button hard to use  

* boot up time in facotry mode (MTK only)

* app freeze and image tranfer fail in wechat

** expand binder buffer size by 128KB

** frameworks/native
libs/binder/ProcessState.cpp
#+begin_src cpp
+ #define BINGER_VM_SIZE ((1*1024*1024) - (4096 * 2) + (4096 * 32)) // ((1*1024*1024) - (4096 *2))
#+end_src

* vmalloc fail

** kernel/msm
arch/arm/mm/mmu.c
#+begin_src c
static void * __initdata vmalloc_min = (void *)(VMALLOC_END - (300 << 20) - VMALLOC_OFFSET); // (VMALLOC_END - (240 << 20) - VMALLOC_OFFSET)
#+end_src

* boot up time GC
** raise the preload GC threshold to avoid frequent GC
** frameworks/base
core/java/com/android/internal/os/ZygoteInit.java
#+begin_src java
private static final int PRELOAD_GC_THRESHOLD = 500000; //50000
#+end_src

* boost first time bootup with LOCAL_DEX_PREOPT

** build
core/prebuilt.mk

* galary database update too slow after sd swap

** 双sdcard, SD swap后，强制删除数据库，保证下次开机后快速更新media database, 保证galary, music快速访问数据库
- jcommand
- init.rc
- 在应用中deviceinfo/lenovousb/SwitchStoragePrefereceCategory.java clearDatabase()中call
  - SystemProperties.set("sys.jcommand_para", "[CLEAR_DATABASE]");
  - SystemProperties.set("ctl.start", "jcommand");

** DONE device/lenovo/s7
init.lenovo.rc
#+begin_src sh
+ service jcommand /system/bin/sh /system/bin/jcommand.sh
class main
disabled
oneshot
#+end_src

** TODO device/lenovo/8939_kk(testmode/jcommand.h)
#+begin_src sh   
+function ClearDatabase() {
	echo "clear database"
	rm /data/data/com.android.providers.media/databases/external.db
	rm /data/data/com.android.providers.media/databases/external.db-shm
	rm /data/data/com.android.providers.media/databases/external.db-wal
}
#+end_src

* EMMC NOSYNC mode: SQLITE_NO_SYNC (sqlite3.c)

*  ATOMIC_WRITE mode (k900)

** improve小数据写入性能(<4KB)
sqlite benchmark, AndroBench, RL Benchmark, Acreve Benchmark

** external/sqlite

dist/Android.mk
#+begin_src sh
+ -DSQLITE_ENABLE_ATOMIC_WRITE
#+end_src

dist/sqlite3.c
#+begin_src c
static int unixDeviceCharacteristics(sqlite3_file *id) {
	unixFile *p = (unixFile*)id;
-	if (p->ctrlFlags & UNIXFILE_PSOW) {
		return SQLITE_IOCAP_POWERSAFE_OVERWRITE;
	} else {
		return 0;
-	}
+	int return Value = 0;
	if (p->ctrlFlags & UNIXFILE_PSROW) {
		returnValue = SQLITE_IOCAP_POWERSAFE_OVERWRITE;
	}
	#ifdef SQLITE_ENABLE_ATOMIC_WRITE
	returnValue |= SQLITE_IOCAP_ATOMIC4K;
	#endif
+	return returnValue;
}

#+end_src

*  adjust LMK adj for laucher to avoid kill when low memory

** when a activity is launched, laucher is switched to BG activity, and maybe killed by LMK in system low memory condition
dumpsys meminfo

** frameworks/base

services/java/com/android/server/am/ActivityManagerService.java
#+begin_src java
private final int computeOomAdjLocked(ProessRecord app, int hiddenAdj, int clientHiddenAdj,
	int emptyAdj, ProcessRecord TOP_APP, boolean recursed, boolean doingAll) {

	if (app.processName.equals("android.process.media")) { };
+	if (app.processName.equals("android.process.acore")) {
		adj = ProcessList.FOREGROUND_APP_ADJ;
		schedGroup = Process.THREAD_GROUP_DEFAULT;
		app.adjType = "launcher";
+	}
}
#+end_src

* adjust long press time from 500ms to 350-400ms (ref 240ms)

** frameworks/base
core/java/android/view/ViewConfiguration.java
#+begin_src java
private static final int DEFAULT_LONG_PRESS_TIMEOUT = 300; // 500
#+end_src

packages/SettingsProvider/res/values/defaults.xml
#+begin_src xml
<integer name="def_long_press_timeout_millis">300</integer> //500
#+end_src

* reduce settings  memory usage

** settings app lauch slow

开启系统过渡动画，优化初始化流程与界面布局，减少第一响应时间
(systrace)

