data/60/950ec2-44bb-4f19-b53b-bd7dcd17ef3f/fancy_pcr.html
<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> frameworks/native</h3>
<div class="outline-text-3" id="text-9-2">
</div><div id="outline-container-sec-9-2-1" class="outline-4">
<h4 id="sec-9-2-1"><span class="section-number-4">9.2.1</span> <span class="done DONE">DONE</span> build/phone-xhdpi-1024-dalvik-heap.mk</h4>
<div class="outline-text-4" id="text-9-2-1">
<div class="org-src-container">

<pre class="src src-sh">dalvik.vm.heapgrowthlimit=192m # old is 96m
dalvik.vm.heapsize=512m # old is 256m
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-9-2-2" class="outline-4">
<h4 id="sec-9-2-2"><span class="section-number-4">9.2.2</span> <span class="todo TODO">TODO</span> why include xhdpi-1024 not xhdpi-2048 for 3GB project(k9)?</h4>
</div>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> broadcast slow</h2>
<div class="outline-text-2" id="text-10">
<p>
MTK建立单独的VIP broadcast queue，后来发现是android原生bug, 已经fix.
</p>
</div>

<div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> frameworks/base</h3>
<div class="outline-text-3" id="text-10-1">
<p>
services/java/com/android/server/am/ActivityManagerService.java
</p>
</div>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> broadcast slow</h2>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> volumn button hard to use</h2>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> boot up time in facotry mode (MTK only)</h2>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> app freeze and image tranfer fail in wechat</h2>
<div class="outline-text-2" id="text-14">
</div><div id="outline-container-sec-14-1" class="outline-3">
<h3 id="sec-14-1"><span class="section-number-3">14.1</span> expand binder buffer size by 128KB</h3>
</div>

<div id="outline-container-sec-14-2" class="outline-3">
<h3 id="sec-14-2"><span class="section-number-3">14.2</span> frameworks/native</h3>
<div class="outline-text-3" id="text-14-2">
<p>
libs/binder/ProcessState.cpp
</p>
<div class="org-src-container">

<pre class="src src-cpp">+ #define BINGER_VM_SIZE ((1*1024*1024) - (4096 * 2) + (4096 * 32)) // ((1*1024*1024) - (4096 *2))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> vmalloc fail</h2>
<div class="outline-text-2" id="text-15">
</div><div id="outline-container-sec-15-1" class="outline-3">
<h3 id="sec-15-1"><span class="section-number-3">15.1</span> kernel/msm</h3>
<div class="outline-text-3" id="text-15-1">
<p>
arch/arm/mm/mmu.c
</p>
<div class="org-src-container">

<pre class="src src-c">static void * __initdata vmalloc_min = (void *)(VMALLOC_END - (300 &lt;&lt; 20) - VMALLOC_OFFSET); // (VMALLOC_END - (240 &lt;&lt; 20) - VMALLOC_OFFSET)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> boot up time GC</h2>
<div class="outline-text-2" id="text-16">
</div><div id="outline-container-sec-16-1" class="outline-3">
<h3 id="sec-16-1"><span class="section-number-3">16.1</span> raise the preload GC threshold to avoid frequent GC</h3>
</div>
<div id="outline-container-sec-16-2" class="outline-3">
<h3 id="sec-16-2"><span class="section-number-3">16.2</span> frameworks/base</h3>
<div class="outline-text-3" id="text-16-2">
<p>
core/java/com/android/internal/os/ZygoteInit.java
</p>
<div class="org-src-container">

<pre class="src src-java">private static final int PRELOAD_GC_THRESHOLD = 500000; //50000
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> boost first time bootup with LOCAL_DEX_PREOPT</h2>
<div class="outline-text-2" id="text-17">
</div><div id="outline-container-sec-17-1" class="outline-3">
<h3 id="sec-17-1"><span class="section-number-3">17.1</span> build</h3>
<div class="outline-text-3" id="text-17-1">
<p>
core/prebuilt.mk
</p>
</div>
</div>
</div>

<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> galary database update too slow after sd swap</h2>
<div class="outline-text-2" id="text-18">
</div><div id="outline-container-sec-18-1" class="outline-3">
<h3 id="sec-18-1"><span class="section-number-3">18.1</span> 双sdcard, SD swap后，强制删除数据库，保证下次开机后快速更新media database, 保证galary, music快速访问数据库</h3>
<div class="outline-text-3" id="text-18-1">
<ul class="org-ul">
<li>jcommand
</li>
<li>init.rc
</li>
<li>在应用中deviceinfo/lenovousb/SwitchStoragePrefereceCategory.java clearDatabase()中call
<ul class="org-ul">
<li>SystemProperties.set("sys.jcommand_para", "[CLEAR_DATABASE]");
</li>
<li>SystemProperties.set("ctl.start", "jcommand");
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-18-2" class="outline-3">
<h3 id="sec-18-2"><span class="section-number-3">18.2</span> <span class="done DONE">DONE</span> device/lenovo/s7</h3>
<div class="outline-text-3" id="text-18-2">
<p>
init.lenovo.rc
</p>
<div class="org-src-container">

<pre class="src src-sh">+ service jcommand /system/bin/sh /system/bin/jcommand.sh
class main
disabled
oneshot
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-18-3" class="outline-3">
<h3 id="sec-18-3"><span class="section-number-3">18.3</span> <span class="todo TODO">TODO</span> device/lenovo/8939_kk(testmode/jcommand.h)</h3>
<div class="outline-text-3" id="text-18-3">
<div class="org-src-container">

<pre class="src src-sh">+function ClearDatabase() {
	echo "clear database"
	rm /data/data/com.android.providers.media/databases/external.db
	rm /data/data/com.android.providers.media/databases/external.db-shm
	rm /data/data/com.android.providers.media/databases/external.db-wal
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> EMMC NOSYNC mode: SQLITE_NO_SYNC (sqlite3.c)</h2>
</div>

<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> ATOMIC_WRITE mode (k900)</h2>
<div class="outline-text-2" id="text-20">
</div><div id="outline-container-sec-20-1" class="outline-3">
<h3 id="sec-20-1"><span class="section-number-3">20.1</span> improve小数据写入性能(&lt;4KB)</h3>
<div class="outline-text-3" id="text-20-1">
<p>
sqlite benchmark, AndroBench, RL Benchmark, Acreve Benchmark
</p>
</div>
</div>

<div id="outline-container-sec-20-2" class="outline-3">
<h3 id="sec-20-2"><span class="section-number-3">20.2</span> external/sqlite</h3>
<div class="outline-text-3" id="text-20-2">
<p>
dist/Android.mk
</p>
<div class="org-src-container">

<pre class="src src-sh">+ -DSQLITE_ENABLE_ATOMIC_WRITE
</pre>
</div>

<p>
dist/sqlite3.c
</p>
<div class="org-src-container">

<pre class="src src-c">static int unixDeviceCharacteristics(sqlite3_file *id) {
	unixFile *p = (unixFile*)id;
-       if (p-&gt;ctrlFlags &amp; UNIXFILE_PSOW) {
		return SQLITE_IOCAP_POWERSAFE_OVERWRITE;
	} else {
		return 0;
-       }
+       int return Value = 0;
	if (p-&gt;ctrlFlags &amp; UNIXFILE_PSROW) {
		returnValue = SQLITE_IOCAP_POWERSAFE_OVERWRITE;
	}
	#ifdef SQLITE_ENABLE_ATOMIC_WRITE
	returnValue |= SQLITE_IOCAP_ATOMIC4K;
	#endif
+       return returnValue;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> adjust LMK adj for laucher to avoid kill when low memory</h2>
<div class="outline-text-2" id="text-21">
</div><div id="outline-container-sec-21-1" class="outline-3">
<h3 id="sec-21-1"><span class="section-number-3">21.1</span> when a activity is launched, laucher is switched to BG activity, and maybe killed by LMK in system low memory condition</h3>
<div class="outline-text-3" id="text-21-1">
<p>
dumpsys meminfo
</p>
</div>
</div>

<div id="outline-container-sec-21-2" class="outline-3">
<h3 id="sec-21-2"><span class="section-number-3">21.2</span> frameworks/base</h3>
<div class="outline-text-3" id="text-21-2">
<p>
services/java/com/android/server/am/ActivityManagerService.java
</p>
<div class="org-src-container">

<pre class="src src-java">private final int computeOomAdjLocked(ProessRecord app, int hiddenAdj, int clientHiddenAdj,
	int emptyAdj, ProcessRecord TOP_APP, boolean recursed, boolean doingAll) {

	if (app.processName.equals("android.process.media")) { };
+       if (app.processName.equals("android.process.acore")) {
		adj = ProcessList.FOREGROUND_APP_ADJ;
		schedGroup = Process.THREAD_GROUP_DEFAULT;
		app.adjType = "launcher";
+       }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> adjust long press time from 500ms to 350-400ms (ref 240ms)</h2>
<div class="outline-text-2" id="text-22">
</div><div id="outline-container-sec-22-1" class="outline-3">
<h3 id="sec-22-1"><span class="section-number-3">22.1</span> frameworks/base</h3>
<div class="outline-text-3" id="text-22-1">
<p>
core/java/android/view/ViewConfiguration.java
</p>
<div class="org-src-container">

<pre class="src src-java">private static final int DEFAULT_LONG_PRESS_TIMEOUT = 300; // 500
</pre>
</div>

<p>
packages/SettingsProvider/res/values/defaults.xml
</p>
<div class="org-src-container">

<pre class="src src-xml">&lt;integer name="def_long_press_timeout_millis"&gt;300&lt;/integer&gt; //500
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> reduce settings  memory usage</h2>
<div class="outline-text-2" id="text-23">
</div><div id="outline-container-sec-23-1" class="outline-3">
<h3 id="sec-23-1"><span class="section-number-3">23.1</span> settings app lauch slow</h3>
<div class="outline-text-3" id="text-23-1">
<p>
开启系统过渡动画，优化初始化流程与界面布局，减少第一响应时间
(systrace)
</p>
</div>
</div>
