fancy_pcr.org
** packages/apps/Settings

AndroidManifest.xml
#+begin_src xml
<activity android:name=".LenovoTabSettings"
-	android:theme="@android:style/Theme.DeviceDefault.Light.NoActionBar"
+	android:theme="@style/ThemeCustomactionBar"
#+end_src
  
res/values/lenovo_style.xml
#+begin_src xml
<style name="CustomeActionBar" parent="@android:style/Widget.Holo.Light.ActionBar">
	<item name="android:windowActionBarOverlay">true</item>
	<item name="android:displayOptions">showHome|useLogo</item>
	<item name="android:homeLayout">@layout/settings_tabs_pager</item>
</style>
#+end_src

src/com/android/settings/AllSettings.java
#+begin_src java
public void onResume() {
-	invalidateHeaders();
+	mHandler.sendEmptyMessageDelayed(REFRESH, 200);
}

+private static final int REFRESH = 1212;

private Handler mHandler = new Handler() {
	public void handleMessage(Message msg) {
		switch (msg.what) {
+		case REFRESH:
			invalidateHeaders();
+			break;
		}
	}
}
#+end_src

* key third party app optimize

** 对常见未开启硬件加速app强制开启，保证帧率
(showfps)

** frameworks/base
core/java/android/content/pm/PackageParser.java
#+begin_src java
+static final ArrayList<String> HWACCENAPPLIST = new ArrayList<String>();
static {
	HWACCENAPPLIST.add("com.sina.weibo");
	HWACCENAPPLIST.add("com.qzone");
+}

+for (int i = 0: i < HWACCENAPPLIST.size(); i++) {
	if (owner.packageName.contains(HWACCENAPPLIST.get(i)))
		hardwareAccelerated = true;
+}
#+end_src

* boot app lauch by temporary change cpu sched policy

** qcom change cpu policy to interactive and online core = 2, mtk plug on multi-core and keep for several seconds (need customization by project)
verify mini freq works after modification
#+begin_src sh
cat /sys/devices/system/cpu/cpu0/cpufreq/scaling_min_freq
cat /sys/devices/system/cpu/cpu0/cpufreq/cpuinfo_max_freq
#+end_src

** TODO kernel/msm
drivers/cpufreq/cpufreq_ondemand.c
#+begin_src c
+ /* good touch experience */
#define LENOVO_CPU_INPUT_BOOST_HIGH_PERF
#ifdef LENOVO_CPU_INPUT_BOOST_HIGH_PERF
#define DEF_CPU_INPUT_BOOST_NUM	(4)
#else
#define DEF_CPU_INPUT_BOOST_NUM (2)
#endif

+/* for input boost, 4 cores, highest cpu freq */
#ifdef LENOVO_CPU_INPUT_BOOST_HIGH_PERF
unsigned long next_jiffies = 0;
#define DVFS_F4	(300000)

static unsigned int cpu_num_base;
module_param(cpu_num_base, int, 0644);
#endif

static void do_dbs_timer(strut work_struct *work)
{
	mutex_lock(&dbs_info->timer_mutex);
	/* for input boost, 4 core and highest cpu freq */
	#ifdef LENOVO_CPU_INPUT_BOOST_HIGH_PERF
	if (dbs_info->cur_policy->min == dbs_info->cur_policy->max
		&& next_jiffies == 0 && 0 == cpu) {
		cpu_num_base = 4;
		next_jiffies = jiffies + msecs_to_jiffies(5000);
	}

	if (next_jiffies != 0 && jiffies > next_jiffies && 0 == cpu) {
		next_jiffies = 0;
		dbs_info->cur_policy->min = (DVFS_F4);
		cpu_num_base = 1;
	} else if (next_jiffies != 0 && jiffies < next_jiffies)
		cpu_num_base = 4;
	#endif
#+end_src

** TODO frameworks/native
services/surfaceflinger/SurfaceFlinger.cpp
#+begin_src cpp
void SurfaceFlinger::computeVisibleRegions(
	const LayerVector& currentLayers, uint32_t layerStack,
	Region& outDirtyRegion, Region& outOpaqueRegion)
{
	while (i--) {
	/* for main display: remove ext layer or background projector layer for all modes once mProjectableLayerVisibleOnMainDisplay is false */
-	if ((bIgnoreLayers && indexLOI != (int)i) ||

+	if ((!dpy && (!mProjectableLayerVisibleOnMainDisplay && layr->isProjectorable())) ||
		/* for other display: remove project layer in mirror mode ONLY, and mProjectableLayerVisibleOnMainDisplay is false
+		(dpy && !mDisplayExtensionMode && !mProjectableLayerVisibleOnMainDisplay && layer->isProjectorable()) ||
		/* for other display: remove internal layer; remove none projectable layers in ext mode */
-		(dpy && mDisplayExtensionMode && !layer->isProjectorable())) {
+		(dpy && mDisplayExtensionMode && !layer->isProjectorable() && (strstr(layer->getName(), "Projectionapplication.VideoActivity") == NULL))) {
		/* ignore all other layers except the layers marked as ext_only by setting visible non transparent region empty */

#+end_src
	
** TODO frameworks/base
services/java/com/android/server/am/ActivityStack.java
#+begin_src java
final void startPausingLocked(boolean userLeaving, boolean uiSleeping) {
-	if (next == null || next.task != prev.task) {
/* do not screenshot when prev is home task */
+ 	if ((next == null || next.task != prev.task) && !prev.task.isHomeTask()) {
#+end_src

* low power: adjust cpu sched policy to achieve balance of power and performance

** CPU限频方案，针对不同场景制定合适的频率策略
- 有功耗问题再考虑此solution
- 根据名单，限制CPU最高频率，调整动态调频和多核管理策略，在性能损失可以忽略的前提下，达到功耗平衡点
- 名单主要关注CPU负荷比较重的场景，按游戏，上网，视频，社交，导航等分类，根据乐商店TOP应用，做CPU频率优化

