data/60/950ec2-44bb-4f19-b53b-bd7dcd17ef3f/fancy_pcr.html

<div id="outline-container-sec-23-2" class="outline-3">
<h3 id="sec-23-2"><span class="section-number-3">23.2</span> packages/apps/Settings</h3>
<div class="outline-text-3" id="text-23-2">
<p>
AndroidManifest.xml
</p>
<div class="org-src-container">

<pre class="src src-xml">&lt;activity android:name=".LenovoTabSettings"
-       android:theme="@android:style/Theme.DeviceDefault.Light.NoActionBar"
+       android:theme="@style/ThemeCustomactionBar"
</pre>
</div>

<p>
res/values/lenovo_style.xml
</p>
<div class="org-src-container">

<pre class="src src-xml">&lt;style name="CustomeActionBar" parent="@android:style/Widget.Holo.Light.ActionBar"&gt;
	&lt;item name="android:windowActionBarOverlay"&gt;true&lt;/item&gt;
	&lt;item name="android:displayOptions"&gt;showHome|useLogo&lt;/item&gt;
	&lt;item name="android:homeLayout"&gt;@layout/settings_tabs_pager&lt;/item&gt;
&lt;/style&gt;
</pre>
</div>

<p>
src/com/android/settings/AllSettings.java
</p>
<div class="org-src-container">

<pre class="src src-java">public void onResume() {
-       invalidateHeaders();
+       mHandler.sendEmptyMessageDelayed(REFRESH, 200);
}

+private static final int REFRESH = 1212;

private Handler mHandler = new Handler() {
	public void handleMessage(Message msg) {
		switch (msg.what) {
+               case REFRESH:
			invalidateHeaders();
+                       break;
		}
	}
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> key third party app optimize</h2>
<div class="outline-text-2" id="text-24">
</div><div id="outline-container-sec-24-1" class="outline-3">
<h3 id="sec-24-1"><span class="section-number-3">24.1</span> 对常见未开启硬件加速app强制开启，保证帧率</h3>
<div class="outline-text-3" id="text-24-1">
<p>
(showfps)
</p>
</div>
</div>

<div id="outline-container-sec-24-2" class="outline-3">
<h3 id="sec-24-2"><span class="section-number-3">24.2</span> frameworks/base</h3>
<div class="outline-text-3" id="text-24-2">
<p>
core/java/android/content/pm/PackageParser.java
</p>
<div class="org-src-container">

<pre class="src src-java">+static final ArrayList&lt;String&gt; HWACCENAPPLIST = new ArrayList&lt;String&gt;();
static {
	HWACCENAPPLIST.add("com.sina.weibo");
	HWACCENAPPLIST.add("com.qzone");
+}

+for (int i = 0: i &lt; HWACCENAPPLIST.size(); i++) {
	if (owner.packageName.contains(HWACCENAPPLIST.get(i)))
		hardwareAccelerated = true;
+}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> boot app lauch by temporary change cpu sched policy</h2>
<div class="outline-text-2" id="text-25">
</div><div id="outline-container-sec-25-1" class="outline-3">
<h3 id="sec-25-1"><span class="section-number-3">25.1</span> qcom change cpu policy to interactive and online core = 2, mtk plug on multi-core and keep for several seconds (need customization by project)</h3>
<div class="outline-text-3" id="text-25-1">
<p>
verify mini freq works after modification
</p>
<div class="org-src-container">

<pre class="src src-sh">cat /sys/devices/system/cpu/cpu0/cpufreq/scaling_min_freq
cat /sys/devices/system/cpu/cpu0/cpufreq/cpuinfo_max_freq
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-25-2" class="outline-3">
<h3 id="sec-25-2"><span class="section-number-3">25.2</span> <span class="todo TODO">TODO</span> kernel/msm</h3>
<div class="outline-text-3" id="text-25-2">
<p>
drivers/cpufreq/cpufreq_ondemand.c
</p>
<div class="org-src-container">

<pre class="src src-c">+ /* good touch experience */
#define LENOVO_CPU_INPUT_BOOST_HIGH_PERF
#ifdef LENOVO_CPU_INPUT_BOOST_HIGH_PERF
#define DEF_CPU_INPUT_BOOST_NUM (4)
#else
#define DEF_CPU_INPUT_BOOST_NUM (2)
#endif

+/* for input boost, 4 cores, highest cpu freq */
#ifdef LENOVO_CPU_INPUT_BOOST_HIGH_PERF
unsigned long next_jiffies = 0;
#define DVFS_F4 (300000)

static unsigned int cpu_num_base;
module_param(cpu_num_base, int, 0644);
#endif

static void do_dbs_timer(strut work_struct *work)
{
	mutex_lock(&amp;dbs_info-&gt;timer_mutex);
	/* for input boost, 4 core and highest cpu freq */
	#ifdef LENOVO_CPU_INPUT_BOOST_HIGH_PERF
	if (dbs_info-&gt;cur_policy-&gt;min == dbs_info-&gt;cur_policy-&gt;max
		&amp;&amp; next_jiffies == 0 &amp;&amp; 0 == cpu) {
		cpu_num_base = 4;
		next_jiffies = jiffies + msecs_to_jiffies(5000);
	}

	if (next_jiffies != 0 &amp;&amp; jiffies &gt; next_jiffies &amp;&amp; 0 == cpu) {
		next_jiffies = 0;
		dbs_info-&gt;cur_policy-&gt;min = (DVFS_F4);
		cpu_num_base = 1;
	} else if (next_jiffies != 0 &amp;&amp; jiffies &lt; next_jiffies)
		cpu_num_base = 4;
	#endif
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-25-3" class="outline-3">
<h3 id="sec-25-3"><span class="section-number-3">25.3</span> <span class="todo TODO">TODO</span> frameworks/native</h3>
<div class="outline-text-3" id="text-25-3">
<p>
services/surfaceflinger/SurfaceFlinger.cpp
</p>
<div class="org-src-container">

<pre class="src src-cpp">void SurfaceFlinger::computeVisibleRegions(
	const LayerVector&amp; currentLayers, uint32_t layerStack,
	Region&amp; outDirtyRegion, Region&amp; outOpaqueRegion)
{
	while (i--) {
	/* for main display: remove ext layer or background projector layer for all modes once mProjectableLayerVisibleOnMainDisplay is false */
-       if ((bIgnoreLayers &amp;&amp; indexLOI != (int)i) ||

+       if ((!dpy &amp;&amp; (!mProjectableLayerVisibleOnMainDisplay &amp;&amp; layr-&gt;isProjectorable())) ||
		/* for other display: remove project layer in mirror mode ONLY, and mProjectableLayerVisibleOnMainDisplay is false
+               (dpy &amp;&amp; !mDisplayExtensionMode &amp;&amp; !mProjectableLayerVisibleOnMainDisplay &amp;&amp; layer-&gt;isProjectorable()) ||
		/* for other display: remove internal layer; remove none projectable layers in ext mode */
-               (dpy &amp;&amp; mDisplayExtensionMode &amp;&amp; !layer-&gt;isProjectorable())) {
+               (dpy &amp;&amp; mDisplayExtensionMode &amp;&amp; !layer-&gt;isProjectorable() &amp;&amp; (strstr(layer-&gt;getName(), "Projectionapplication.VideoActivity") == NULL))) {
		/* ignore all other layers except the layers marked as ext_only by setting visible non transparent region empty */
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-25-4" class="outline-3">
<h3 id="sec-25-4"><span class="section-number-3">25.4</span> <span class="todo TODO">TODO</span> frameworks/base</h3>
<div class="outline-text-3" id="text-25-4">
<p>
services/java/com/android/server/am/ActivityStack.java
</p>
<div class="org-src-container">

<pre class="src src-java">final void startPausingLocked(boolean userLeaving, boolean uiSleeping) {
-       if (next == null || next.task != prev.task) {
/* do not screenshot when prev is home task */
+       if ((next == null || next.task != prev.task) &amp;&amp; !prev.task.isHomeTask()) {
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> low power: adjust cpu sched policy to achieve balance of power and performance</h2>
<div class="outline-text-2" id="text-26">
</div><div id="outline-container-sec-26-1" class="outline-3">
<h3 id="sec-26-1"><span class="section-number-3">26.1</span> CPU限频方案，针对不同场景制定合适的频率策略</h3>
<div class="outline-text-3" id="text-26-1">
<ul class="org-ul">
<li>有功耗问题再考虑此solution
</li>
<li>根据名单，限制CPU最高频率，调整动态调频和多核管理策略，在性能损失可以忽略的前提下，达到功耗平衡点
</li>
<li>名单主要关注CPU负荷比较重的场景，按游戏，上网，视频，社交，导航等分类，根据乐商店TOP应用，做CPU频率优化
</li>
</ul>
</div>
</div>
