fancy_pcr.org
** frameworks/base
core/java/android/view/Choreographer.java
#+begin_src java
+private static FrameDisplayEventReceiver mFakeDisplayEventReceiveer;

private Choreographer(Looper looper)
{
+	mFakeDisplayEventReceiver = mDisplayEventReceiver;
}

+public static void setVsyncType(int value) {
	mFakeDisplayEventReceiver.setVsyncType(value);
}
#+end_src

core/java/android/view/DisplayEventReceiver.java
#+begin_src java
+private static native void nativeSetVsyncType(int receiverPtr, int value);

/* FPS_60_30 */
+public void setVsyncType(int value) {
	if (mReceiverPtr != 0)
		nativeSetVsyncType(mReceiverPtr, value);
}
#+end_src
core/jni/android_view_DisplayEventReceiver.cpp
#+begin_src cpp
class NativeDisplayEventReceiver : public LooperCallback {
public:
+	status_t setVsyncType(int value);
  
+status_t NativeDisplayeventReceiver::setVsyncType(int value) {
	status_t status = mReceiver.setVsyncType(value);
	if( status)
		return status;
	return OK;
}
#+end_src

services/java/com/android/server/am/ActivityStack.java
#+begin_src java
private void completePauseLocked() {
+	Choreographer.setVsyncType(60);
}
#+end_src

services/java/com/android/server/am/ActivityStackSupervisor.java
#+begin_src java
+static Map<String, Integer> map = new HashMap<String, Integer>();
+static {
	map.put("com.lenovo.browser", 1728000);
	map.put("com.UCMobile.cmcc", 1728000);
	map.put("com.tencent.mm", 1728000);

	map.put("com.autonavi.cmccmap", 1267200);
...;
}

+private static final String LIMIT_CPU_LIST = "/data/list.txt";
+private static List<String> mCpuList = new ArrayList<String>();

-public void setFpsHashMap(boolean flag) {};
+public void setFpsHashMap() {
	mCpuList = splitFileIntoList(LIMIT_CPU_LIST);
	for (int i = 0; i < mCpuList.size(); i++) {
		String str = mCpuList.get(i);
		String type = getLimitType(str);
		String pkg = getLimitPackageName(str);
		int freq = Integer.parseInt(getLimitFreq(str));
		if (type.equals("add"))
			map.put(pkg, freq);
		else if (type.equals("del"))
			map.remove(pkg);
	}
}
#+end_src

* touch false alarm in the edge, filter in touch driver

** 窄边框边缘误触

** kernel/msm
drivers/input/touchscreen/s3408/synaptics_dsx_i2c.c
#+begin_src c
int X_DEL = 10; //0
#+end_src

* 通话界面启动速度

* boost first time app lauch

** frameworks/base
services/java/com/android/server/am/ActivityStack.java
#+begin_src java
final void startPausingLocked(boolean userLeaving, boolean uiSleeping) {
-	if (next == null || next.task != prev.task) {
/* do not screenshot when prev is home task */
+ 	if ((next == null || next.task != prev.task) && !prev.task.isHomeTask()) {
#+end_src

* switch animation

* screen off gesture

* screen off camera

* linaro toolchain update

** linux-arm-androideabi-4.8-linaro
- thumb -O2 optimize
- mfpu neon-vfp4 (neon V2)
- makefile (toolchain and O2)

* qcom improve orientation change perf

** kernel/msm
drivers/video/msm/mdss/mdss_fb.c

drivers/video/msm/mdss/mdss_fb.h

drivers/video/msm/mdss/mdss_mdp_intf_video.c

drivers/video/msm/mdss/mdss_mdp_overlay.c

* opengl parameter tuning

** tuning
- http://source.android.com/devices/tuning.html
- http://pompidev.net/2013/09/20/opengl-texture-size-and-performance-texture-cache-androidios-gles-2/, texture and cache size

** frameworks/base
libs/hwui/Properties.h
#+begin_src c
#define DEFAULT_TEXTURE_CACHE_SIZE 72.0f //128.0f
#define DEFAULT_LAYER_CACHE_SIZE 48.0f //16.0f
#define DEFAULT_RENDER_BUFFER_CACHE_SIZE 8.0f //2.0f
#define DEFAUlT_PATH_CACHE_SIZE 40.0f //10.0f
#define DEFAULT_GRADIENT_CAHE_SIZE 1.0f //0.5f
#define DEFAULT_DROP_SHADOW_CACHE_SIZE 6.0f //2.0f
#+end_src

libs/hwui/font/FontUtil.h
#+begin_src c
#define DEFAULT_TEXT_SMALL_CACHE_HEIGHT 1024 //512
#define DEFAULT_TEXT_LARGE_CACHE_HEIGHT 1024 //512
#+end_src

* touch FW (landlock distance tuning)

* config zram size to balance perf/function

* DRAM turbo mode (risky)

* improve input event response by change cpu freq

** cpu/gpu provile in certain context
- input 响应速度
- android powerhal

** kernel/msm
drivers/cpufreq/cpufreq-ondemand.c
#+begin_src c
+static int hardkey_boost = 0;

static void do_dbs_timer(struct work_strut *work)
{
-	next_jiffies = jiffies + msecs_to_jiffies(5000);
+	if (hardkey_boost) {
		next_jiffies = jiffies;
		hardkey_boost = 0;
	} else
+		next_jiffies = jiffies + msecs_to_jiffies(5000);
}

static void dbs_input_event(struct input_handle *handle, unsigned int type
	unsigned int code, int value)
{
+	/* for input(hard key) boost 4 core, highest cpu freq */
	#ifdef LENOVO_CPU_INPUT_BOOST_HIGH_PERF
	if ((type == EV_KEY) && value == 1 && (KEY_MENU == code || KEY_HOMEPAGE == code || KEY_BACK == code)) {
		struct cpu_dbs_info_s *dbs_info = &per_cpu(od_cpu_dbs_info, 0);
		dbs_info->cur_policy->min = dbs_info->cur_policy->max;
		hardkey_boost = 1;
	}
	#endif
#+end_src

* neon in skia bionic memcpy

* [PCR-117]low power

** push app list to devcie is possible

