data/60/950ec2-44bb-4f19-b53b-bd7dcd17ef3f/fancy_pcr.html

<div id="outline-container-sec-26-2" class="outline-3">
<h3 id="sec-26-2"><span class="section-number-3">26.2</span> frameworks/base</h3>
<div class="outline-text-3" id="text-26-2">
<p>
core/java/android/view/Choreographer.java
</p>
<div class="org-src-container">

<pre class="src src-java">+private static FrameDisplayEventReceiver mFakeDisplayEventReceiveer;

private Choreographer(Looper looper)
{
+       mFakeDisplayEventReceiver = mDisplayEventReceiver;
}

+public static void setVsyncType(int value) {
	mFakeDisplayEventReceiver.setVsyncType(value);
}
</pre>
</div>

<p>
core/java/android/view/DisplayEventReceiver.java
</p>
<div class="org-src-container">

<pre class="src src-java">+private static native void nativeSetVsyncType(int receiverPtr, int value);

/* FPS_60_30 */
+public void setVsyncType(int value) {
	if (mReceiverPtr != 0)
		nativeSetVsyncType(mReceiverPtr, value);
}
</pre>
</div>
<p>
core/jni/android_view_DisplayEventReceiver.cpp
</p>
<div class="org-src-container">

<pre class="src src-cpp">class NativeDisplayEventReceiver : public LooperCallback {
public:
+       status_t setVsyncType(int value);

+status_t NativeDisplayeventReceiver::setVsyncType(int value) {
	status_t status = mReceiver.setVsyncType(value);
	if( status)
		return status;
	return OK;
}
</pre>
</div>

<p>
services/java/com/android/server/am/ActivityStack.java
</p>
<div class="org-src-container">

<pre class="src src-java">private void completePauseLocked() {
+       Choreographer.setVsyncType(60);
}
</pre>
</div>

<p>
services/java/com/android/server/am/ActivityStackSupervisor.java
</p>
<div class="org-src-container">

<pre class="src src-java">+static Map&lt;String, Integer&gt; map = new HashMap&lt;String, Integer&gt;();
+static {
	map.put("com.lenovo.browser", 1728000);
	map.put("com.UCMobile.cmcc", 1728000);
	map.put("com.tencent.mm", 1728000);

	map.put("com.autonavi.cmccmap", 1267200);
...;
}

+private static final String LIMIT_CPU_LIST = "/data/list.txt";
+private static List&lt;String&gt; mCpuList = new ArrayList&lt;String&gt;();

-public void setFpsHashMap(boolean flag) {};
+public void setFpsHashMap() {
	mCpuList = splitFileIntoList(LIMIT_CPU_LIST);
	for (int i = 0; i &lt; mCpuList.size(); i++) {
		String str = mCpuList.get(i);
		String type = getLimitType(str);
		String pkg = getLimitPackageName(str);
		int freq = Integer.parseInt(getLimitFreq(str));
		if (type.equals("add"))
			map.put(pkg, freq);
		else if (type.equals("del"))
			map.remove(pkg);
	}
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> touch false alarm in the edge, filter in touch driver</h2>
<div class="outline-text-2" id="text-27">
</div><div id="outline-container-sec-27-1" class="outline-3">
<h3 id="sec-27-1"><span class="section-number-3">27.1</span> 窄边框边缘误触</h3>
</div>

<div id="outline-container-sec-27-2" class="outline-3">
<h3 id="sec-27-2"><span class="section-number-3">27.2</span> kernel/msm</h3>
<div class="outline-text-3" id="text-27-2">
<p>
drivers/input/touchscreen/s3408/synaptics_dsx_i2c.c
</p>
<div class="org-src-container">

<pre class="src src-c">int X_DEL = 10; //0
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> 通话界面启动速度</h2>
</div>

<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> boost first time app lauch</h2>
<div class="outline-text-2" id="text-29">
</div><div id="outline-container-sec-29-1" class="outline-3">
<h3 id="sec-29-1"><span class="section-number-3">29.1</span> frameworks/base</h3>
<div class="outline-text-3" id="text-29-1">
<p>
services/java/com/android/server/am/ActivityStack.java
</p>
<div class="org-src-container">

<pre class="src src-java">final void startPausingLocked(boolean userLeaving, boolean uiSleeping) {
-       if (next == null || next.task != prev.task) {
/* do not screenshot when prev is home task */
+       if ((next == null || next.task != prev.task) &amp;&amp; !prev.task.isHomeTask()) {
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-30" class="outline-2">
<h2 id="sec-30"><span class="section-number-2">30</span> switch animation</h2>
</div>

<div id="outline-container-sec-31" class="outline-2">
<h2 id="sec-31"><span class="section-number-2">31</span> screen off gesture</h2>
</div>

<div id="outline-container-sec-32" class="outline-2">
<h2 id="sec-32"><span class="section-number-2">32</span> screen off camera</h2>
</div>

<div id="outline-container-sec-33" class="outline-2">
<h2 id="sec-33"><span class="section-number-2">33</span> linaro toolchain update</h2>
<div class="outline-text-2" id="text-33">
</div><div id="outline-container-sec-33-1" class="outline-3">
<h3 id="sec-33-1"><span class="section-number-3">33.1</span> linux-arm-androideabi-4.8-linaro</h3>
<div class="outline-text-3" id="text-33-1">
<ul class="org-ul">
<li>thumb -O2 optimize
</li>
<li>mfpu neon-vfp4 (neon V2)
</li>
<li>makefile (toolchain and O2)
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-34" class="outline-2">
<h2 id="sec-34"><span class="section-number-2">34</span> qcom improve orientation change perf</h2>
<div class="outline-text-2" id="text-34">
</div><div id="outline-container-sec-34-1" class="outline-3">
<h3 id="sec-34-1"><span class="section-number-3">34.1</span> kernel/msm</h3>
<div class="outline-text-3" id="text-34-1">
<p>
drivers/video/msm/mdss/mdss_fb.c
</p>

<p>
drivers/video/msm/mdss/mdss_fb.h
</p>

<p>
drivers/video/msm/mdss/mdss_mdp_intf_video.c
</p>

<p>
drivers/video/msm/mdss/mdss_mdp_overlay.c
</p>
</div>
</div>
</div>

<div id="outline-container-sec-35" class="outline-2">
<h2 id="sec-35"><span class="section-number-2">35</span> opengl parameter tuning</h2>
<div class="outline-text-2" id="text-35">
</div><div id="outline-container-sec-35-1" class="outline-3">
<h3 id="sec-35-1"><span class="section-number-3">35.1</span> tuning</h3>
<div class="outline-text-3" id="text-35-1">
<ul class="org-ul">
<li><a href="http://source.android.com/devices/tuning.html">http://source.android.com/devices/tuning.html</a>
</li>
<li><a href="http://pompidev.net/2013/09/20/opengl-texture-size-and-performance-texture-cache-androidios-gles-2/">http://pompidev.net/2013/09/20/opengl-texture-size-and-performance-texture-cache-androidios-gles-2/</a>, texture and cache size
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-35-2" class="outline-3">
<h3 id="sec-35-2"><span class="section-number-3">35.2</span> frameworks/base</h3>
<div class="outline-text-3" id="text-35-2">
<p>
libs/hwui/Properties.h
</p>
<div class="org-src-container">

<pre class="src src-c">#define DEFAULT_TEXTURE_CACHE_SIZE 72.0f //128.0f
#define DEFAULT_LAYER_CACHE_SIZE 48.0f //16.0f
#define DEFAULT_RENDER_BUFFER_CACHE_SIZE 8.0f //2.0f
#define DEFAUlT_PATH_CACHE_SIZE 40.0f //10.0f
#define DEFAULT_GRADIENT_CAHE_SIZE 1.0f //0.5f
#define DEFAULT_DROP_SHADOW_CACHE_SIZE 6.0f //2.0f
</pre>
</div>

<p>
libs/hwui/font/FontUtil.h
</p>
<div class="org-src-container">

<pre class="src src-c">#define DEFAULT_TEXT_SMALL_CACHE_HEIGHT 1024 //512
#define DEFAULT_TEXT_LARGE_CACHE_HEIGHT 1024 //512
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-36" class="outline-2">
<h2 id="sec-36"><span class="section-number-2">36</span> touch FW (landlock distance tuning)</h2>
</div>

<div id="outline-container-sec-37" class="outline-2">
<h2 id="sec-37"><span class="section-number-2">37</span> config zram size to balance perf/function</h2>
</div>

<div id="outline-container-sec-38" class="outline-2">
<h2 id="sec-38"><span class="section-number-2">38</span> DRAM turbo mode (risky)</h2>
</div>

<div id="outline-container-sec-39" class="outline-2">
<h2 id="sec-39"><span class="section-number-2">39</span> improve input event response by change cpu freq</h2>
<div class="outline-text-2" id="text-39">
</div><div id="outline-container-sec-39-1" class="outline-3">
<h3 id="sec-39-1"><span class="section-number-3">39.1</span> cpu/gpu provile in certain context</h3>
<div class="outline-text-3" id="text-39-1">
<ul class="org-ul">
<li>input 响应速度
</li>
<li>android powerhal
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-39-2" class="outline-3">
<h3 id="sec-39-2"><span class="section-number-3">39.2</span> kernel/msm</h3>
<div class="outline-text-3" id="text-39-2">
<p>
drivers/cpufreq/cpufreq-ondemand.c
</p>
<div class="org-src-container">

<pre class="src src-c">+static int hardkey_boost = 0;

static void do_dbs_timer(struct work_strut *work)
{
-       next_jiffies = jiffies + msecs_to_jiffies(5000);
+       if (hardkey_boost) {
		next_jiffies = jiffies;
		hardkey_boost = 0;
	} else
+               next_jiffies = jiffies + msecs_to_jiffies(5000);
}

static void dbs_input_event(struct input_handle *handle, unsigned int type
	unsigned int code, int value)
{
+       /* for input(hard key) boost 4 core, highest cpu freq */
	#ifdef LENOVO_CPU_INPUT_BOOST_HIGH_PERF
	if ((type == EV_KEY) &amp;&amp; value == 1 &amp;&amp; (KEY_MENU == code || KEY_HOMEPAGE == code || KEY_BACK == code)) {
		struct cpu_dbs_info_s *dbs_info = &amp;per_cpu(od_cpu_dbs_info, 0);
		dbs_info-&gt;cur_policy-&gt;min = dbs_info-&gt;cur_policy-&gt;max;
		hardkey_boost = 1;
	}
	#endif
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-40" class="outline-2">
<h2 id="sec-40"><span class="section-number-2">40</span> neon in skia bionic memcpy</h2>
</div>

<div id="outline-container-sec-41" class="outline-2">
<h2 id="sec-41"><span class="section-number-2">41</span> [PCR-117]low power</h2>
<div class="outline-text-2" id="text-41">
</div><div id="outline-container-sec-41-1" class="outline-3">
<h3 id="sec-41-1"><span class="section-number-3">41.1</span> push app list to devcie is possible</h3>
</div>
