fancy_pcr.org
** frameworks/base
services/java/com/android/server/am/ActivityManagerService.java

#+begin_src java
+	private HandlerThread mHandlerThread;
+ 	private PULimitHandler mCpuLimitHandler = null;


public void systemReady(final Runnable goingCallback) {
+	mHandlerThread = new HandlerThread("ScanCPULimitList");
	mHandlerThread.start(0;
	mCPULimitHandler = new CPUlimitHandler(mHandlerThread.getLooper());
	mCPULimitHandler.removeMessages(0);
	Message ScanBeginMsg = new Message();
	ScanBeginMsg.what = 0;
+	mCPULimitHandler.sendMessageDelayed(ScanBeginMsg, 60000);

}

+private final class CPULimitHandler extends Handler {
	public CPULimitHandler (Looper looper) {
		super(looper, null, true);
	}

	@Override
	public void handleMessage(Message msg) {
		switch(msg.whaat) {
		case 0:
			mStackSupervisor.setFpsHashMap();
			break;
		}
	}
}

#+end_src

* [PCR-118]non-linear backlight

** kernel/msm
drivers/video/msm/mdss/dss_dsi_panel.c

#+begin_src c
static void mdss_dsi_panel_blkt_dcs(struct mdss_dsi_ctrl_pdata *ctrl, int level)
{
	if (level >=0 && level <=10)
		real_level = (unsigned long)level;
	else if(level <= 128 && level > 10)
		real_level = ((unsigned long)level*65 + 530)/118;
	else if (level <=205 && level > 128)
		real_level = ((unsigned long)level*80 - 4465)/77;
	else if (level <=255 && level > 205)
		real_level = (unsigned long)level*2 - 255;
}
#+end_src

* [PCR-120]boost camera lauch

** kernel/msm

arch/arm/boot/dts/msm8974-camera.dtsi
#+begin_src c
&master0 {
	qcom,hw-thigh = <20>; //78
	qcom,hw-tlow = <28>; //114
	qcom,hw-tsu-sto = <6>; //28
	qcom,hw-tsu-sta = <7>; //28
	qcom,hw-thd-dat = <13>; //10
	qcom,hw-thd-sta = <11>; //77
	qcom,hw-tbuf = <25>; //118
	qcom,hw-tsp = <3>; //1
}
#+end_src

* [PCR-123] cpu freq limit according to cpu thermal sensor

** vendor/qcom-proprietary
thermal-engine/ss-data.c
#+begin_src c
static struct setting_info ss_cfgs_8974_pro_ac[] =
{
	{
		.set_point = 80000, //90000
	}
}
#+end_src

thermal-engine/ss_algorithm.c
#+begin_src
+static int handle_timer_done = 0;

static void handle_timer_sig(void)
{

+if(sampling_count >= 20 && !priv_control) {
	if (sampling_count <= 60)
		fix_mitigation_lvl(&algo_clnt[idx]);
	else
		sampling_count = 0;
	handle_timer_done = 1;
	continue;
+}
if (EO < 0) {};
algo_clnt[idx].tc_delay = 0;
+handle_timer_done = 1;

static void *algo_monitor(void *data)
{
	while(1) {
		handle_timer_sig();
+		if (handle_timer_done) {
			handle_timer_done = 0;
			sampling_count++;
+		}
	}
}

#+end_src

* [PCR-124] dalvik GC threshold

* [PCR-160] touch feedback
** frameworks/base

policy/src/com/android/internal/policy/impl/PhoneWindowManager.java


