data/60/950ec2-44bb-4f19-b53b-bd7dcd17ef3f/fancy_pcr.html

<div id="outline-container-sec-41-2" class="outline-3">
<h3 id="sec-41-2"><span class="section-number-3">41.2</span> frameworks/base</h3>
<div class="outline-text-3" id="text-41-2">
<p>
services/java/com/android/server/am/ActivityManagerService.java
</p>

<div class="org-src-container">

<pre class="src src-java">+       private HandlerThread mHandlerThread;
+       private PULimitHandler mCpuLimitHandler = null;


public void systemReady(final Runnable goingCallback) {
+       mHandlerThread = new HandlerThread("ScanCPULimitList");
	mHandlerThread.start(0;
	mCPULimitHandler = new CPUlimitHandler(mHandlerThread.getLooper());
	mCPULimitHandler.removeMessages(0);
	Message ScanBeginMsg = new Message();
	ScanBeginMsg.what = 0;
+       mCPULimitHandler.sendMessageDelayed(ScanBeginMsg, 60000);

}

+private final class CPULimitHandler extends Handler {
	public CPULimitHandler (Looper looper) {
		super(looper, null, true);
	}

	@Override
	public void handleMessage(Message msg) {
		switch(msg.whaat) {
		case 0:
			mStackSupervisor.setFpsHashMap();
			break;
		}
	}
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-42" class="outline-2">
<h2 id="sec-42"><span class="section-number-2">42</span> [PCR-118]non-linear backlight</h2>
<div class="outline-text-2" id="text-42">
</div><div id="outline-container-sec-42-1" class="outline-3">
<h3 id="sec-42-1"><span class="section-number-3">42.1</span> kernel/msm</h3>
<div class="outline-text-3" id="text-42-1">
<p>
drivers/video/msm/mdss/dss_dsi_panel.c
</p>

<div class="org-src-container">

<pre class="src src-c">static void mdss_dsi_panel_blkt_dcs(struct mdss_dsi_ctrl_pdata *ctrl, int level)
{
	if (level &gt;=0 &amp;&amp; level &lt;=10)
		real_level = (unsigned long)level;
	else if(level &lt;= 128 &amp;&amp; level &gt; 10)
		real_level = ((unsigned long)level*65 + 530)/118;
	else if (level &lt;=205 &amp;&amp; level &gt; 128)
		real_level = ((unsigned long)level*80 - 4465)/77;
	else if (level &lt;=255 &amp;&amp; level &gt; 205)
		real_level = (unsigned long)level*2 - 255;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-43" class="outline-2">
<h2 id="sec-43"><span class="section-number-2">43</span> [PCR-120]boost camera lauch</h2>
<div class="outline-text-2" id="text-43">
</div><div id="outline-container-sec-43-1" class="outline-3">
<h3 id="sec-43-1"><span class="section-number-3">43.1</span> kernel/msm</h3>
<div class="outline-text-3" id="text-43-1">
<p>
arch/arm/boot/dts/msm8974-camera.dtsi
</p>
<div class="org-src-container">

<pre class="src src-c">&amp;master0 {
	qcom,hw-thigh = &lt;20&gt;; //78
	qcom,hw-tlow = &lt;28&gt;; //114
	qcom,hw-tsu-sto = &lt;6&gt;; //28
	qcom,hw-tsu-sta = &lt;7&gt;; //28
	qcom,hw-thd-dat = &lt;13&gt;; //10
	qcom,hw-thd-sta = &lt;11&gt;; //77
	qcom,hw-tbuf = &lt;25&gt;; //118
	qcom,hw-tsp = &lt;3&gt;; //1
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-44" class="outline-2">
<h2 id="sec-44"><span class="section-number-2">44</span> [PCR-123] cpu freq limit according to cpu thermal sensor</h2>
<div class="outline-text-2" id="text-44">
</div><div id="outline-container-sec-44-1" class="outline-3">
<h3 id="sec-44-1"><span class="section-number-3">44.1</span> vendor/qcom-proprietary</h3>
<div class="outline-text-3" id="text-44-1">
<p>
thermal-engine/ss-data.c
</p>
<div class="org-src-container">

<pre class="src src-c">static struct setting_info ss_cfgs_8974_pro_ac[] =
{
	{
		.set_point = 80000, //90000
	}
}
</pre>
</div>

<p>
thermal-engine/ss_algorithm.c
</p>
<pre class="example">
+static int handle_timer_done = 0;

static void handle_timer_sig(void)
{

+if(sampling_count &gt;= 20 &amp;&amp; !priv_control) {
	if (sampling_count &lt;= 60)
		fix_mitigation_lvl(&amp;algo_clnt[idx]);
	else
		sampling_count = 0;
	handle_timer_done = 1;
	continue;
+}
if (EO &lt; 0) {};
algo_clnt[idx].tc_delay = 0;
+handle_timer_done = 1;

static void *algo_monitor(void *data)
{
	while(1) {
		handle_timer_sig();
+		if (handle_timer_done) {
			handle_timer_done = 0;
			sampling_count++;
+		}
	}
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-45" class="outline-2">
<h2 id="sec-45"><span class="section-number-2">45</span> [PCR-124] dalvik GC threshold</h2>
</div>

<div id="outline-container-sec-46" class="outline-2">
<h2 id="sec-46"><span class="section-number-2">46</span> [PCR-160] touch feedback</h2>
<div class="outline-text-2" id="text-46">
</div><div id="outline-container-sec-46-1" class="outline-3">
<h3 id="sec-46-1"><span class="section-number-3">46.1</span> frameworks/base</h3>
<div class="outline-text-3" id="text-46-1">
<p>
policy/src/com/android/internal/policy/impl/PhoneWindowManager.java
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Zhang Jing</p>
<p class="date">Created: 2015-05-05 周二 17:00</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
